[
   {
      "txt": "As an avid Disney fan, I was not totally impressed by this movie, certainly not motivated enough to catch it in the theaters. I am, however, so glad that I caught it on DVD and watched the special features.<br /><br />You MUST check out the \"Moose commentary\": the entire movie can be viewed with commentary from Rutt and Tuke, the comic relief moose of the story, who are voiced by Rick Moranis and Dave Thomas. Two veterans of the famous Second City comedy troupe ad-lib - in character - for an hour and a half about a movie that they are clearly fond of. I laughed the whole time. The enjoyment I got from this commentary completely made up for the tepid reaction I had to the film itself. Do yourself a favor and listen to it!",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "This is definitely one of the best Kung fu movies in the history of Cinema. The screenplay is really well done (which is not often the case for this type of movies) and you can see that Chuck (in one of his first role)is a great actor. The final fight with the sherif deputy in the bullring is a masterpiece!",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "The movie is nice Well pictured, but no originality...<br /><br />this movie is directly copied from \"The Hitch\" where Salman plays like a Date Dr. like Will Smith, and Govinda like some fat jerk, who is desperate to get in love with her boss by the end the movie comes to an old Indian Flimi style, the bride's father doesn't like the bride's lover and gets some other groom, and Govinda the bride's lover comes in the end and saves her from the new groom and a fancy dance and stuff.<br /><br />the comedy was real good, no doubt when the hitch meets Hindi would be more funnier....<br /><br />Ultimately worth a watch but when it comes on TV after few months...",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "In the early 1990's \"Step-by-Step\" came as a tedious combination of the ultra-cheesy \"Full House\" and the long-defunct loopy classic hit \"The Brady Bunch\". The differences between \"Step-by-Step\" and the two aforementioned shows was of course better writing, excellent comedic timing from almost all of it's actors, and a great deal funnier situations that weren't quite as sugar-coated as it's extremely popular predecessors. Admittedly though, even with the big boosts in the show's basic dynamics and all it still wasn't exactly spectacular, nor was it really even that memorable in the long line of corny family programming! It was just a much better time-passer, you might say, in comparison to the cutesy migraine-inducing \"Full House\", which coincidentally, ran neck-and-neck with \"Step-by-Step\" during that time period in terms of overall popularity. The show, now in syndication obviously, is certainly suitable family-fare but be sure to not expect much beyond that when watching it.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I've read approximately 10 reviews of this film, but haven't taken any of them \"to heart\". Harrison Ford is being criticized for everything from his haircut to his earring and I really don't see what any of these things have to do with the film. As I recall, he had bad hair plus bad reviews in Blade Runner but it's still a favorite among us videophiles. It is slower than the majority of his previous films but not worthy of the trashings it has received.<br /><br />I would gladly pay $7.50 just to watch a bald Harrison Ford mow his lawn.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "This is a pretty simplistic romance. Girl finds boy, girl loves boy, girl loses boy, girl finds boy. Colleen Moore is the outstanding ingredient in this recipe, delivering a wonderfully varied dramatic/romantic performance, well deserving of an Oscar nom. Equally fine are the aerial combat special effects.<br /><br />Moore plays a French girl whose mother has turned over their field to a British aerial squadron during WWI. She is the \"daughter of the regiment\", loved as a little sister. Into this mix comes a fill-in for a downed flyer, Gary Cooper. At first they hate each other, then they love each other, then the entire squadron is sent out on a suicide mission. Cooper returns but crashes in the village and a red cross unit removes him. Moore searches for him, is told at a hospital he is dead, then wanders the streets until he calls from a hospital window and they are reunited.<br /><br />It's a nice little romance, but hardly more than that. Recommended for fans of Ms. Moore and Mr. Cooper",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "This two-character drama is extremely well-acted and has a valid message and some TRULY shocking moments (shocking not because they are graphic, but because you're not prepared for them when they come). But eventually it does become oppressive, just like the somewhat similar \"A Pure Formality\" did. Still, Alan Rickman should have gotten an Oscar nomination for his multi-dimensional performance, no doubt about it. (**1/2)",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Dare Rudd (John Wayne) and sidekick Dink Hooley (Syd Saylor) are itinerant cowpunchers who can't seem to stay in one place very long. In \"Helltown\", the boys are headed to Montana, where they meet up with Rudd's cousin Tom Fillmore (Johnny Mack Brown), who offers them a job. It's a hoot to see the boys wearing aprons as they start out as cooks with the herd, although Dare becomes self conscious when Miss Judith (Marsha Hunt) rides into camp. Judy is Tom's girl, but the attraction between her and Dare is evident early on.<br /><br />Fillmore has a cattle herd to move, and promotes Dare to running the drive, partly to prove to Judy that he may not be up to the task. Meanwhile, bad guy Bart Hammond (Monte Blue) has his eyes on Fillmore's cattle, but when his henchmen fail to rustle the herd, he figures it's easier to win the money that Dare was paid at the end of the trail. Conning Dare into a rigged card game with his man Brady (James Craig), Dare's money begins to evaporate hand after hand. It's only when Dare fails to show up back at Fillmore's ranch that Tom goes out to find his cousin. Exposing the cheats, Tom, Dare and Dink high tail it before the bad guys can get their revenge.<br /><br />\"Helltown\", also known as \"Born to the West\", was released in 1937 by Favorite Films Corporation, a couple of years after Wayne's series of Westerns for Lone Star Productions. It only slightly alters the Lone Star formula; Wayne does get the girl at the end of the film, but here he was trying. There's a great runaway horse scene where Wayne rescues Marsha Hunt, in which Johnny Mack Brown's horse does a complete somersault spill. Syd Saylor does a nice job as the comic relief pal, doing his best to sell lightning rods to unsuspecting victims. He replaces familiar faces George \"Gabby\" Hayes and Yakima Canutt here, staples of the Lone Star films. John Wayne's charisma is beginning to develop here, preparing him for the leap to super star status that he eventually achieved. <br /><br />\"Helltown\" was based on a novel by legendary Western author Zane Grey. If you're looking for more films based on Grey's stories, try \"Fighting Caravans\" with Gary Cooper, \"The Light of Western Stars\" with Victor Jory, \"Drift Fence\" with Buster Crabbe, and \"Heritage of the Desert\" with Randolph Scott.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I think Crewes did her evil part very well she should have won an award. Anything that Dunne is in. is salvageable because Dunne is a great actress and can pull anything off, even a weak script. Therefore I WOULD recommend it for this reason alone. This movie may have been a little ahead of it's time, the plot might be more acceptable these days.<br /><br />During the golden age of Hollywood movies were meant to entertain or teach, mostly to make us feel good or cope with the times. This plot seem to deviate from that profile. Yet, again I must say what ever Irene Dunne was in, at least, was \"good\" because she made things so believable! The only other actress I can say made me think this way was maybe, Deborah Kerr. Watch Silver Cord if you get the chance for the \"acting\" if nothing else.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "This was one of Christie's later stories. Throughout her long career, she was interested in the shifting narrative and the notion of conflicting agents. Both are essentially the same thing and boil down to questions of who it is that controls or creates the situation.<br /><br />In detective fiction, the game is a matter of conflicting realities. The murderer intends to change reality to fool the detective, the writer intends to do the same to the reader. Both the reader and the detective are in similar battles to create what they see. That's why her stories often include a writer.<br /><br />In her works, she explores every combination of tricks she can think of that deal with this. Along the way, we often have bodies that are not who they seem, and times, and intended victims and such. But the real magic of the books is this notion of control. In 'Bertram's' it was literally a building.<br /><br />Here, it is a dead man. Well, sometimes that happens, but not like this. It is as if the writer were the famous Mr. Rafiel. This is particularly sweet to Marple readers who remember this same character from the 'Carribean Mystery,' which in a way was also framed by her nephew. In that story, Rafiel was the conveyor of the story to the authorities.<br /><br />The producers of this series have an almost wacky commitment to using a different creative team on each one. Sometimes it produces bland work. The 'Bertram's' episode was rather brilliantly staged. This one is the most lavish of the lot, and has an active camera. But unlike the 'Bertram's' work, it has nothing to do with the story.<br /><br />The camera moves and captures merely because it can. The 'Citizen Kane' quote at the beginning was a little too literal and blunt. This story is good, but the adapter took out some pretty critical stuff, and that irrelevant camera annoys.<br /><br />Ted's Evaluation -- 2 of 3: Has some interesting elements.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Simon Wests pg-13 thriller about a babysitter who gets disturbing prank calls while sitting at a mansion is neither original nor exciting enough to be called a good film. Although there are some elements of suspense, good eye candy and decent characters, the film is just another I know what you did last summer, as it falls short of being taken seriously. The performances were alright, but nothing special with this flick, i say skip it, unless you are looking for a mediocre movie, you can find better films than this on lifetime sometimes, okay maybe not lifetime but at least USA or somethin, haha.... <br /><br />7/10",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Ugh, what an embarrassing episode last night! It was either a failed script for \"ABC Afterschool Special\", or the product of an earnest rookie writer, just out of college, making an homage to that classic PC anti-gun homily from 1974, \"The Gun\". In fact hubby & were disappointed that the closing shot wasn't of The Gun being melted down like in the movie!<br /><br />No, I'm not some NRA shill. It's just that when the producer of an intelligent & nuanced series gets it in his head that I should be subjected to a didactic dramatization of his personal Cause, I'd appreciate it if the lecture at least wasn't delivered via 2-by-4. Geez!<br /><br />OK, the sociology lesson is over. The Message has been delivered. The Important Episode has been aired. Now let's get back to some entertaining episodes that try to respect our intelligence.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Dead or Alive: Final, the movie that supposedly brings together the three films in the very loose Dead or Alive trilogy, and connected mostly by its stars, Riki Takeiuchi and Sho Aikawa and that each film has its share of bizarro-world fixtures and neuroses and heaps of violence, is admittedly the weakest of the lot. That none of the three films ends up being a disappointment is less a testament to the creativity of the material but to the pound-for-pound guts that director Takashi Miike takes with the surroundings and the material. Here he presents an overtly dystopian future, however low-key, where a homosexual mayor/dictator (Richard Chen) has the entire village drugged except for a group of rebels. There's also replicants- robots- in this year of 2346, one of them is Ryo (Aikawa), a robot of complete lethal skill but also with the capacity to love and learn and so forth. Then a cop, Takeshi (Takeiuchi) happens to be the mayor's top guard. But things start to unravel on both sides, Ryo teaming up with the rebels and Takeshi with his employer, though blood-soaked mishaps like a hostage trade-off gone bad, and with Takeshi finding out his wife and son are robots (not done in an Alien mood, mind you, just suddenly as if in a the power went out), and that he himself is one as well. And it all leads up to one last, inexplicable showdown between the two men.<br /><br />Strange that there's yet another film where Miike has peaks and valleys here, sometimes finding that middle ground of success where science fiction can have some meaning to it. But there really isn't anything to take from this story, except that the mayor/dictator is a dingbat with no back-story who gets his rocks off making sure his drug stops couples from getting pregnant and that everything remains under control. He also has along with him his love slave, I'd guess, in the hilarious non-speaking part of a saxophone player who also doubles sometimes as a human fixture when not plugging away the moody blues. Meanwhile, we get the conventional sides to Ryo and Takeshi's stories, and they're never uninteresting, just not totally convincing enough to hold interest. Of course Miike isn't above having some fun, like when Takeshi plops Michelle (Maria Chen) in to the water to get her to swim after a near-assassination attempt on the mayor, or in having the original rebel leader speaking English for no good reason at all. There's even a playful homage to old sci-fi cartoons at the start of the film. But there's nothing very compelling substance-wise, with the exception of Takeshi's minor turns at becoming \"good\" midway through the film (helping one couple get by with clearance to have a kid), and mostly Miike's strengths this time are purely stylistically and in the choice of locations and sets.<br /><br />It's like a grungy Japanese Alphaville where everything still has a contemporary feel through all of the special effects. And I really liked the yellow-green tint Miike used through the movie, as it impacted very well in outdoor scenes and added just enough grittiness in the indoor scenes. But as for peaks and valleys, one sees this ever more clearly- and the sci-fi movie channel level of visual effects, with maybe a few more dollars put into it- during the climax. This contains some of the funniest material in the most delirious, Freudian sensibility from the director, even if it has to get started by unbearable contrivance; the way that Ryo and Takeshi finally meet up is sort of random and just a means for the producers to try and cheaply tie together the past two films, when it wasn't needed. On the other hand, in terms of the sheer guilty entertainment value of a flick like Miike's where one sees something totally unexpected and very crudely sexual, it ranks right up there with the best scenes in Happiness of the Katakuris and Visitor Q. Overall, Dead or Alive: Final is a cheesy 90 minute effort that doesn't take itself TOO seriously, and is better off all the more for its wicked contrivances, militaristic decay and cultural hang-ups put on pulp-level display.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "!!! Spoiler alert!!!<br /><br />The point is, though, that I didn't think this film had an ending TO spoil... I only started watching it in the middle, after Matt had gotten into Sarah's body, but then I became fascinated by the bizarreness of the plot, even for a Channel 5 movie... and couldn't possibly see how Matt wld end up happy. What about his fiancee? At one stage looked like he was gonna get with his best friend, surely icky and wrong... and then the whole 'oggi oggi oggi' thing does NOT WORK as a touching buddy-buddy catchphrase, tis just ridiculous... so was going 'surely he can't just come back to life? and yet how can he live as a woman?' and then the film just got over that by ending and not explaining anything at all!!!!! What's that about??? I was so cross, wasted a whole hour of my life for no reason at all!!! :) but was one of the funniest films I've ever seen, so, swings and roundabouts",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "it's the best film that takes the first place at the sickest and an useful films ever made in this poor country. really u people even don't know what the word cinema means and u cast votes for movies, i'm really curious to know how many movies of P.P.P. or L.Bunuel have u seen. The score of this \"faield experiment\" it reflects a lot of u're way of understanding things and to recognize a good/quality movie when u see it. We the Romanian people have only ONE movie and until this day the status hasn't change & that movie is \"Padurea Spanzuratilor\". But I don't lose my time thinking how many of you have seen it. That is a movie that respects all the required quality's's of an MOVIE. From the script to the frames and even to the quality/clarity of the picture even are past over him 41 years. I recommend to the voters to search for better movies and then vote. KuDos will See u later .",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I haven't actually seen a lot of movies with Holly Hunter, but seeing her in Broadcast News was a pleasant surprise. She is a hard-nosed journalist, Jane Craig, who has devoted all of her time to TV news show. Her colleague Aaron Altman has carried her torch for a long time without saying anything. The love triangle is completed by Tom Grunnick. He is the slightly aloof ex-sportscaster who is the new reporter. To Jane, he symbolizes everything she doesn't like about news reporting - turning it into edutainment, not serious business. Much to her surprise, Jane finds herself attracted to Tom.<br /><br />Holly Hunter is doing a great performance as the perky journalist. But I don't quite see what she finds so charming about her new colleague, Tom. It's something with them that prevents us from getting up close and personal with him. Almost as impressive is Albert Brooks, who gives his all in the role of a professional who gives more than 100 percent for his job but doesn't get quite as much in return. Actually, for a while I thought he was Steve Guttenberg from Police Academy (1984). He has a few funny lines and if this was a Meg Ryan-picture, they'd call it a romantic comedy.<br /><br />Running over two hours, a few scenes could have been edited or left out completely, eg. Jane's and Aaron's trip to Central America. Also, I'm a sucker for happy endings and had preferred a different ending than just a reunion between the three of them seven years later.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "For late-80s cheese, this really isn't so bad. There are a lot of pretty funny throwaway one-liners (\"That was grand theft!\" - \"Thanks!\") and Madonna gives a fine performance; nothing award-worthy here, but that goes for Razzies as well as Oscars. I'm curious to know if the movie would have been better received if she had used her regular (pre-British influenced) speaking voice rather than the hyper-Bronxy accent used instead. Oh well. As a side note, I got to meet one of the actors who played one of the motorcycle cops through my work; he said that it was a fun film to work on but gave me the sad news that the actor who played Buck the UPS delivery guy died about a year after Who's That Girl",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I have seen this movie three times. Going back to VCR's, in the 1980's, and again on The Encor channel last night (Feb.11, 2010). Based on a true story which I remember being in the news, during the early 1980's, I've decided that I find it too disturbing to watch ever again. Yet it's hard to look away from a car accident. The creepiest character is Joshua John Miller, who plays Keeanu Reeves little brother. <br /><br />(The story this movie was based on can be found anywhere on the Internet -- just Google it. It's about Anthony Jacques Broussard who murdered Marcy Conrad in Milpitas, California, in 1981.) The characters portray Generation X pre-grunge, borderline sociopaths, with the exception of Keeanu Reeves, who grows a conscience.<br /><br />Old hippies did a great job raising that generation.<br /><br />For such a young kid, I thought Joshua Miller was excellent, as the serial killer in the making character. In actuality, he went to Yale, and has written screenplays as well as directed. His acting capabilities in this film were amazing. Just the way he treats his little sister by drowning her doll, and tearing up her dolls grave, gave me the shivers. It gave me nightmares. Even with whats happening in our world today, in 2010, it still is the most degenerate film I've seen to date. <br /><br />The apathy, and dysfunction, of these families, is enough to make one puke. This thrill kill almost makes the Manson murders pale in comparison. <br /><br />Crispon Glover got a little too much into character. He wound up on David Lettermen to discuss his role, and almost kicked the host in the head. Apparrently Glover had to seek psychiatric help after portraying his character. <br /><br />Also, fight the good fight to the great Dennis Hopper. You're one of the best!",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I saw Bogard when it was released in the 70s. It was one of those pictures that received an X rating for violence. We snuck into our local grindhouse, and saw it anyway. Pretty good picture. Lots of blood from the street fights, although the cheap sound effects for the punches took something away from it. And lots of sex. I remember one of the early scenes when Bogard meets this pretty brunette in an apartment she is showing him. Without saying a word, he picks her up, puts her in the windowsill and nails her. From what I remember the picture sailed from that point on. So, when I found out Bogart is also called Black Fist and was available on VHS, I ordered it online. I was very disappointed. Black Fist is Bogard edited for television. So many of the scenes I remember were missing, I wondered if indeed, this was the same picture.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "This show has been performed live around the country with a wide variety of casts. I saw it first in the Provincetown production the first summer it was in P-town (2001)--before it was, curiously enough, banned in that overwhelmingly gay resort (the codes which resulted in its closing have since been amended). I saw it again later in the off-Broadway, long-running production in New York. Oddly enough, the P-town production was far better than the New York one--fresher, cuter, more spirited and funnier--but that was only in the 2001 showing; subsequent attempts to clone the production (\"Bare Naked Lads\" in 2007) were definitely third-rate. This filmed production features a Los Angelos production cast, and it is, as other comments have suggested, not the best. I would rate it somewhere in between the top-notch 2001 P-town production and the third-rate \"Bare Naked Lads\" P-town show from last summer.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Sure, this film was retarded. But you expected that the moment you looked at the cover-box. It's a B movie, and on the T&A factor this movie delivered. Truthfully, it was funnier than expected. While it was by no means a work of comedic genius, like \"The Party Animal\" or \"Orgazmo\", as far as B movies go it was worth the watch, if you're into that sort of thing anyway.<br /><br />Christians and morally-oriented parental groups, this is soft-core adult entertainment. If you don't want your children watching sexual content and nudity, then you should keep your children away from this film.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "The bearings of western-style Feminism on the various subcultures of India have hitherto remained largely non-existent, the two entities belonging to alien realms and threatening (in the name of tradition) never to coincide. Art imitates life (or so the claim goes) and popular Hindi cinema is no exception, reflecting an underlying misogyny which, regrettably, forms the foundation of much of the collective Indian culture. But why? What is it about the female gender that has rendered it so hateful to the culture that women are routinely subject to the most unimaginable horrors, including rape, murder, infanticide, imposed illiteracy, infidelity, and the subjugation of spirit that goes under the name of 'dowry'? Rajkumar Santoshi's latest offering, \"Lajja\", asks the same plaintive question, linking the atrocities committed against women through three separate chapters/episodes which comprise the journey of shame endured by its protagonist, Vaidehi (Manisha Koirala).<br /><br />Direction on Santoshi's part is not up to par with the level the story demands. He fails to achieve the necessary sensitivity in depicting the saga of sadness and confronts the issue of misogyny from the side, instead of head-on. Santoshi has recently said that he did not make the film for an international film festival, but rather for the masses of his country. Regrettably, the tackiness shows, and the film too often delves into the action-blood-gore genre that Santoshi specializes in. The film suffers from its jerky, episodic pace and its ending is rather too contrived.<br /><br />The female cast is given much kinder and more rounded characterizations than their male counterparts. The protagonist is played sensitively by the luminescently beautiful Manisha Koirala who proves in Lajja that she is one of our time's more competent leading ladies, and given a proper role and set up, emerges with a truly commendable performance. One wonders how brilliantly she may have shone had the film been made by a director with the appropriate creative intention and appreciation of the issue at hand. Mahima Choudhary puts in a laudable performance and continues to show that she is an untapped talent. Cast as Janki, Madhuri Dixit performs with a never-before-seen fervor and felicity for what truly deserves the name of 'acting.' The role of a street smart performer who finds solace in alcohol and the promise of an unborn child stands as the greatest risk in her cannon of song-n-dance roles which have maintained her marquee status over the past decade. Which leaves the final and most disturbing performance in this would-be feminist saga, that of the ceaselessly talented Rekha. Lajja is Manisha Koirala's film, there can be no doubt about that, but it is Rekha who dominates the proceedings in a performance that digs into your bones and sends echoes of terror through the vestibules of your heart. Rekha dazzles as Ramdulari, foregoing vanity and complacency to deliver a performance that is so replete with authenticity and ingenuity that emotional nudity becomes the mantra of this portion of the film. Comparisons are indeed odious, especially when rendered opposite one of the world's great leading ladies, but in the gracious presence of this reigning screen legend the others fade in her shadow.<br /><br />\"Lajja\" has none of the sophistication of proto-feminist dramas like \"Zubeidaa\", \"Pinjar\", or even the Hell-Queen celebration \"Laadla\": it fulfills its feministic goals in two early moments:the loud tirade in which Mahima berates her in-laws for their abuse of her father who has committed no other crime than given birth to a girl. She erupts, leaving the wedding procession in shambles. Seeing her father devastated, she begins to weep, blaming herself for the chaotic destruction in front of her. She bemoans, \"Why did I say anything? I have ruined everything! It is all my fault!\" Her grandmother, witnessing silently the abuse she bore, comforts her by saying, \"Why are you crying? There is no reason for you to be crying. You are not at fault for anything. The fault is mine. The fault is of every woman who came before you, because if we had had the courage to say in our day what you have said today, there would have been no need for you to say anything today.\" In this scene the importance of the Feminist Legacy is laid plainly in sight through words.<br /><br />The other, more subtle moment comes very early in the film when Vaidehi (Manisha) has fled from her abusive husband to the refuge of her parents' home in India. To viewers of western societies, it may seem perfectly reasonable (indeed, natural) that any abused woman would seek the protective guardianship of her parents; this, however, is a societal taboo in many eastern cultures, India among them. Once a woman has been married, the identity she assumes is that of her husband and his personal assets (family, business, children, etc.) For her to turn her back on these responsibilities is a grave social sin, one which truly has no equivalent for the western woman. She is thereafter regarded as tainted and as 'damaged goods', one whose value has been nullified entirely by her own actions and her refusal to submit to the role she has been given. She is not so much an individual as she is an emblem of familial honor. Her father rebukes her for her actions, concerned that his familial honor will be tarnished irreparably by the daughter he had already transferred to another man. His primary concern is that of the impending marriage of Vaidehi's younger sister, a prospect made far less likely with a divorced elder daughter in the same household. He tells her in no uncertain that she must return to the man to whom she lawfully belongs, however violent and sadistic he may be. He levies against her the age old adage that, \"The honor of every home lies in the hands of its daughter.\" Quietly and pensively, she replies, \"Yes, the honor of every home lies in the hands of its daughter. But there is no honor for the daughter herself.\"",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "One of the first things I noticed that allowed this culture to stand out among the rest was during the wake at Sole's place. An aerial shot is used to show Sole being flowered with kisses by a sea of women. I believed this was a commentary on the closeness that women had for each other of this culture\u0097ones who stuck together across the generations, separations and misunderstandings, and still being able to bond and rely on each other. Also, the film seemed to glorify women as almost flawless individuals. What I mean by flawless is that they did not suffer the consequences for their actions and were treated as if they had no imperfections. An example of this is shortly after Paula accidentally killed her father. Her mother immediately comes to her rescue and takes full responsibility for the act while Paula seems to suffer almost no remorse for what she has done. Again, another example of this is when each daughter (or granddaughter) has had an opportunity to reunite with their supposed \"dead\" mother (grandmother). Knowing the stresses that this has most likely caused in their family, each one of them still embraces the mother without care for what she has done\u0097that is, killing her husband and his lover. In this light, women are portrayed as ones who not only love each other independent of character acts, but also ones who don't seem bothered in the least by the acts in which their friends/family members perform.<br /><br />Another idea that I thought was intriguing of this culture was in regards to their idea of the supernatural. With the death of Raimunda and Sole's mother and her inexplicable return, the director builds the audience's emotions to believe that this film is going to embody the supernatural. The people depicted in this culture seem very supernatural, that is to say, very eager to believe that life exists beyond the grave. Their aunt, long-time friend Augustina, the prostitute and other people living in the city of La Mancha all believe the rumors of the dead coming back to family members to finish the \"unfinished business.\" I believed this was a mixed reflection of the culture's religious faith (predominantly Catholic) as well as their need to make amends with those who had no chance to be forgiven during mortality. The belief they held in regards to the dead being \"alive\" was also to give hope to the destitute circumstances they suffered in mortality. When the viewer is exposed to the fact that this film isn't supernatural at all, it's interesting to observe the role the mother continues to play. She's treated as if she still is a ghost (i.e. hiding in small crevices (underneath the bed or inside a car trunk)). I believe the director portrayed the mother this way to heighten the already existent supernatural beliefs the city had adopted. The mother's character seemed to be a metaphor for the city's long-held belief in life after death.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Yes, it might be not historically accurate(actually only 6 soldiers of 9th rota were killed there), and yes, it has some mistakes and exaggeration(bended machine gun? come on! or the that \"history lesson\" about how Afghanistan was never conquered by anyone - educated Russian officer would know history much better than that - take for example British campaign in Afghanistan). And yes, it does not have multi-million dollars Hollywood-style special effects, but it's strongest point in showing soldier's life there, their relationships and their feelings when the best friends are being killed in front of their eyes. In my opinion 9ya rota really does a good job showing all those things.<br /><br />Again, movie has it weaknesses, but, in my opinion, it appears to be one of the strongest Russian movie for the past few years.<br /><br />8/10",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "There is no denying that this is a bad movie. The acting isn't great, likewise the script, acting and direction. Still, I cannot wait until its 2/23/99 video release from Anchor Bay. Everyone knows there are several bad movies out there that have a tremendous appeal to them. This one tops my list.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "This movie changed my life! Hogan's performance was nothing short of incredible, and I still haven't recovered from his exclusion from the 1990 Oscar nominations. And as brightly as the Hulkster shines in this movie, you can't discount the brilliant writing and direction that vaults this masterpiece in to the highest strata of achievement in film. If you haven't seen this movie, drop what your doing right now and get yourself a copy. I guarantee it will blow your mind. And if you don't like it, then I just have one question for you.... Watcha gonna do when the 24 inch pythons and Hulkamania runs wild on you!!!!",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Scarier than any horror movie ever made because you're in controlled of this blood fest which make it more scarier than watching other people doing it on the big screen or on your television screen. This game got two CDs which make the game much more entertaining.<br /><br />Each cd contains a different character with a complete different story line which make the game much more fun. I recommend you to buy this game and the first game too (isn't as good as this game, still fun though)<br /><br />****<br /><br />",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Some twenty or so years ago, Charles Bukowski was a hero of mine. I blindly accepted the image that was created by intellectual types and seen in various films. Of course, I never got to meet the intellectual types that prescribed Bukowski as a hero. They usually could be found safely behind the counter at hipster video stores and record shops. These people hardly talked and when asked a question, usually sneered and nodded in some vague direction. They were useless when it came to locating a specific title, but their shelves were always stocked with strange and unique titles. To be inducted in the secret hipster club, I believed I had to shed my bourgeois up-bringing and espouse the counter-culture.<br /><br />My introduction to Bukowski started with the movie Barfly, the late 80's film that starred Mickey Rourke and Faye Dunnaway. I was a fan of Rourke at the time. He also embodied a sort of modern male fantastical anti-hero, a brooding intellectual type. At the time, this appealed to me. Barfly's hero scoffed at convention. A mid-30's tramp, who lives life with no ties, answers to no one, --Oh--and to be recognized as a genius by a hot female literary snob, icing on the cake. Afterwards, I read Post-Office and Hollywood, the later being Bukowski's take on his experience with the film.Now, allow me to fast-forward to the latest film based on Bukowski's book Factotum, one which I read and enjoyed. Bukowski takes the form of Chinaski in this novel. I often wonder where Bukowski ended and Chinaski began. 20 years after Barfly, the fictional movie Bukowski is still the same. I have watched about an hour of the movie and I have yet to see signs of the facade cracking. Here is why Factotum Bukowski was my hero. Chinaski is handsome (played by Matt Dillon). He has clean neat hair, styled, but not over the top. When Dillon smokes and writes, he looks cool. Chinaski goes from job to job, ignoring and/or fighting with various bosses. He screws two floozies, one of whom he lives with, walks out on, only to return to with little repercussion. Chinaski is his own man and we never see him emote. He's a sterile, one-dimensional, 30 something, James Dean archetype. Factotum lies to the viewer. It does so by haranguing the idea of a man (a writer) without consequence. A poor man, who's suffering for his art. What could be cooler than that? Now, let's say there are some truths to Factotum, in that the events took place. What the audience is missing is the pain that shrouds Chinaski's existence. Maybe the point of this movie, and most movies, is that for 80 mins., we need to escape the world that's filled with consequence and pain and take-up vicariously with an anti-social womanizer, that smokes, talks, drinks with detached coolness. One who rejects conventional behavior of job and family. My hero used to be Movie Bukowski. Long ago, that would have worked. It was easier then. Now, I have yet to claim a hero. Things are not as easy. Hipster logic and movie renditions of counter-culture icons offer no solutions or even ask questions.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "It's 1913. A studio prop boy spies the actress who is going to become Hollywood's next great movie star and he's the director that's going to make it happen. After inventing pie throwing and the keystone cops, his dream comes true. Being completely absorbed in his film-making, however, he fails to notice that he is losing his leading lady to another man. Several over-budget flops later, he is known as nothing more than the director who turned down Rin-tin-tin. Fortunately for him, the loyal and compassionate residents of Hollywood are untainted by ambition and ego. He'll be okay as long as he still has his friends.<br /><br />This movie starts out as a mad-cap comedy typical of the time period, and in the opening scenes it holds its own with the best of them. It has a playful lack of self-consciousness which is sorely missing in most of today's comedies. Shortly into the film, however, it moves away from this mode of comedy and instead attempts to entertain us using the films within the film. These are silent slapstick comedies, well done but nothing out of the ordinary, and they go on for much longer than is necessary for any audience which has seen the originals. Upon returning, the film takes a dramatic turn. It's well written and the cast does an excellent job of making the transition, but the movie really should have decided from the beginning what it was going to be.<br /><br />By the end of the film, it has transformed once again - this time into a paean to the glitter of Hollywood. The small town of Los Angeles has grown up into the city which makes the movies that entertain the whole world.<br /><br />In spite of its promising beginnings, this film has not aged particularly well. Nevertheless, it does have some strong scenes, a certain nostalgic appeal, and an entertaining sub-text about the people who made it and the audiences it was made for.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Of course I have disappeared into the movies. The Neil Young concert film 'Heart of Gold.' <br /><br />There have been many great concert films through the years. The best being Martin Scorsese's 'The Last Waltz' which filmed the Band's last concert at Filmore West. A phenomenal concert and a phenomenal film, that is if you love rock and roll and felt as if you had been born into it and were part of the music, and could be in the band if you had a better guitar and someone would show you the chords and that with a few chords and a lyric or two you could change the world...as you can guess I felt all five to the bottom of my twenty four year old soul. <br /><br />Neil Young was in 'The Last Waltz.' They had to digitally, before digital actually, they had to manually scrape a big hanging cocaine rock that extruded from his nose so in the film there's a bright light that is not the star of Bethlehem dangling above his lip and below his nostril...it's a famous bit of rock and roll history. <br /><br />But 'The Last Waltz' was made when the Band and Neil and everyone else was in their thirties and 'Heart of Gold' was filmed last year when Neil is in his sixties and his band looks as if they are in their late nineties and the entire movie could visually be used by the Christian Right and the DEA in the same way that those Ohio State Patrol films of the perils of drunk driving were used when I was in high school showing dead teenagers hanging through front windows or dangling from trees or bloody in a ditch. <br /><br />Close your eyes and it is a terrific concert, open them and view Dorian Grey's hidden portrait. Case in point, the once ethereally beautiful Emmylou Harris literally coming out of the darkness to sing with Neil and from dark to light appearing to be a ring wraith leapt full borne out of the river in front of Rivendale. Ghastly, ghostlike, a nose that doesn't appear in nature and is not an advertisement for plastic surgery, eyes that make buttons on dolls look lifelike, and the ability to express any emotion, human or not, constrained by unrestrained over indulgence in Botox. My mind reeled...porcupine...Peru...Jack Daniels...living hard for decades...my god...sweet Emmylou Harris who I saw sing for free at Fred's in Boulder, a face a 2000 year dead Pharoah would not accept. But the voice, as pure as a thick lipped bottle of Boulder beer brewed from the waters of Boulder Creek and I closed my eyes and smelled ammmmmbbbererrrrrrrrrgerrrrrrrssss (an homage...one must use homage at least once in any film review...to Fred's hamburgers on Boulder Mall and the Steve Martin Pink Panther movie). <br /><br />It would have been a terrific concert sitting in the dark in Ryman Auditorium, maybe twenty rows back. But, close up, in close ups, it was a medieval morality play depicting the horrors of indulgence and the consequences of a sinful life. <br /><br />The concert theme, emblazoned on the scenery, A Prairie Wind...the last song, massed guitars (I counted eight) and I wondered if irony was at play. I don't think so. A Native American bass player, a lead guitarist who looked and dressed like Buffalo Bill, a piano player whose face looked like the screamer's face in Munch's The Scream, the chick singers (actually matronly singers, mostly reminding one of the lost youth of senior United flight attendants still plying the friendly skies) dressed in matching full length distressed denim dresses...no it was played straight. <br /><br />None of them had seen, I would bet, A Mighty Wind. <br /><br />It will be a great CD, and would be glad to tell tales of hippy dippy Boulder when Neil was a long haired Canadian crooner whose indecipherable lyrics seemed to mirror heartache and loss, feelings as universal then as now. <br /><br />But, only in a dark bar.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "A bus drops off a nameless man outside a run-down Standard Oil gas station in the middle of nowhere. We never learn where the bus came from, or why he is on it, or who he even is. Why is he the only passenger? Is he a prisoner? Is he the \"bothersome man\" referred to in the title of the movie? Has he died and gone to heaven, or hell? Like our man, we don't get a chance to stop and wonder. He is met by a gatekeeper of sorts and shuttled off to a nondescript city. From day one, all the choices are made for him. An apartment has been rented, a job has been found, an office assigned. In fact, his life is not entirely unlike life in the virtual reality of corporate cubicles and suburban condos. Women are heartless, dinner parties are a drag, office jobs suck. But some pieces don't fit the puzzle. Silently efficient, gray-clad goons roam the streets. Are they some sort of paramedics, or the secret police? And why are there no children? Is the story even set in the real world? Whenever we think we might be getting some answers, new mysteries unfold. \"The Bothersome Man\" leaves you half relieved that it's over, half wanting more. I hope they make it into a computer game soon.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Dear Readers,<br /><br />I've found in my studies of movies that whenever Michael Bay makes a movie, people pan it and hate it, yet they still go to see it and it makes somewhere around 100 million dollars. Why? Because Michael Bay is one of the top five directors of all time. Standing alongside Ridley Scott, Spielberg, Kubrick, and Miyazaki, Michael Bay has cemented himself as Hollywood's best action/adventure director. That point is proved with his most panned film, Armageddon.<br /><br />An Asteroid the size of Texas is hurtling towards the planet and the only way NASA can think to take it down is to land a team of men on the asteroid, drill to its core, and drop a nuclear warhead inside then blow up the asteroid. Only one person is qualified enough to do it: Bruce Willis. Willis portrays Harry Stamper, a grizzled hardened oil driller trying to keep what's left of his family together. Not helping that fact is his daughter, Grace (Liv Tyler), having an affair with his best driller, AJ (Ben Affleck). Hired by Dan Truman (Billy Bob Thornton), the head of NASA, Stamper and his team of roughneck drillers train to become astronauts and save the world.<br /><br />Armageddon is a two part movie. First there's the funny parts where we meet the gang and wackiness abounds. Then they get into space and all the comedy gets sucked out the window and is replaced by mind-blowing special effects, cool music, and great serious acting. Murphy's law goes insane in the second part, meaning that everything that can go wrong, does in fact go wrong, increasing the tension of the film to outstanding levels.<br /><br />With a cool cast and crew (Michael Bay as Director, Jerry Bruckheimer and Gale Anne Hurd as Producers, and J.J. Abrams as one of the scriptwriters.), tons of special effects, great humor, awesome music, plus an intro done by Mr. Ben-Hur himself, Charlton Heston, Armageddon rocks big time.<br /><br />Signed, The Constant DVD Collector, Matt Macleod<br /><br />Parental Warnings: This is not a film for kids. The F-bomb is used a few times and lots of other swear words are used as well, plus there's a Strip bar scene and the extremely intense second part might be too hard for a kid to handle.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "L'OSSESSA, also known as THE TORMENTED or THE SEXORCIST, or the ridiculously titled THE EERIE MIDNIGHT HORROR SHOW, is a forgotten EXORCIST rip-off which contains one of the best horror moments I've ever seen. The scene is when the crucifix comes alive. This great spooky scene is unforgettable and totally effective (great FXs). It's a shame the rest of the movie doesn't maintain the level of creepiness exemplified during that scene.<br /><br />This is one of the most frustrating movies ever. Imagine the producers deciding to to make an EXORCIST copy but while making it, they actually succeed in creating something truly original (a possessed sculpture of crucified man, which is shocking when you think about it) but then completely forgets their original idea in order to make a boring and uninspired EXORCIST rip-off. Had the film continued with the possessed sculpture concept (with the characters trying to destroy it, etc), this film would have rocked. But once the girl becomes possessed by the spirit of the sculpture, she never tells anyone from where the demon came from. She, and the script, completely forgets the haunted crucifix, which is STUPID!!!<br /><br />If you like so-called \"Euro-cult\" movies, the first 45 minutes deliver unlike any other Euro-cult movies. But after the scene when the girl has a vision of being crucified and she gets stigmatas, the remaining 45 minutes SUCK. Boring. It goes nowhere fast as it tries to emulate (badly) THE EXORCIST. So, watch the first 45 minutes of L'OSSESSA and enjoy the 1970s fashions, the sleaze and the amazing statue-comes-alive-to-ravish-the-girl scene but after the first 45 minutes, press stop and eject, and might as well go clip your toenails.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "The film's subject is poignant and very real. It happened. One can debate some artistic liberties taken by director and scriptwriter. The subject is what makes the film tick--nothing else. I saw the film for the first time after the real Phoolan, was gunned down in New Delhi and had served several years as an elected Member of Parliament in India. By the way, she was not the first untouchable elected to Parliament, as some reviewers stated. The so-called \"untouchables\" have been elected to the Indian Parliament for decades in reserved constituencies.<br /><br />While Shekhar Kapur as a director is a hero to many India, because he made commercially accepted international films---\"Bandit Queen\" and \"Elizabeth\" (and a tolerable kiddie movie called \"Mister India\", which was accepted by the average Indian audiences)---and even got Oscar nominations for Elizabeth, I do not place him as a top notch film director from India. He fails in every department as a director except perhaps that he succeeds in getting some above-average performances from his actors. Subtlety, finesse, charm are not easy to find in his films--melodrama brims in them.<br /><br />His idea of using Nusrat Fateh Ali Khan's vocal rendering of the song in the early parts of the film, was perhaps his single major achievement on the undistinguished sound track of \"Bandit Queen\". And then perhaps the creaking doors during the gang rape sequence. Otherwise the film looked like a spaghetti western with sex and violence minus the great music one associates with them. <br /><br />If you are looking for a good living Indian film director who makes realistic cinema of international quality--it is not Shekhar Kapur's movies you should see; it is the later works of three Indian film-makers Adoor Gopalakrishnan, Mrinal Sen, and Girish Karnad and of course Muzaffar Ali's \"Umrao Jaan\". It is unfortunate that none of those directors had the financial support that Kapur had to give them and their films an international viewership. For instance, Sen's \"Oka oorie katha\" made in Telugu, or Satyajit Ray's \"Sadgati\" based on Munshi Prem Chand's \"Kafan\" are more complete as films to an intelligent viewer dealing on the state of the untouchables in India. Sen did not have to resort to graphic sex and violence but merely suggested them. Of course, Sen's nugget did not make headlines, while Kapur's effort hogged them.<br /><br />To Kapur's credit, he is articulate and used his limited talent and modest resources in the Mumbai film industry to take his products beyond home audiences. For that effort, I salute Kapur. But \"Bandit Queen\" will remain a great subject awaiting an accomplished director to deal with it.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Where do I start. Do I say how great the cinematography is. Do I praise certain scenes which show the directors creativity. Do I tell how realistic the scenes on Ellis Island are. Should I mention that for a change we do not have the cliché scene of viewing Statue Of Liberty. (By now immigrants viewing the statue from the ships railing is a cliché)<br /><br />Now whats not likable, two major things, one being a modern song score & not even a good one to boot.<br /><br />Second & nearly deadly the film is boring it moves so slow, that watching paint dry would be an improvement.<br /><br />The 118 minute running time is to long & yet the film seems unfinished. We see no scenes of this family in the US. Our hero mentions he wants to find his twin brother, I would have enjoyed scenes of his futile of maybe lucky search, instead of other drawn out scenes.<br /><br />The film is a near miss.<br /><br />Ratings *** (out of 4) 81 points (out of 100) IMDb 7 (out of 10)",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "The third film based on Charles Belden's play entitled \"Mystery of the Wax Museum\" (1933) targets generation X-tasy. Twin screenwriters, Chad Hayes and Carey W. Hayes, spend more time developing the main characters than other slasher movies--a promising start. Their condition guarantees an authentic point of view. The role of Paige (Paris Hilton) was not much of a stretch for the world's favorite heiress. She peruses \"In Style,\" stripteases boys, chats on a cell, and frets over an ill-conceived pregnancy. Her regular routine has been altered beyond repair. Hilton reached the peak of her performance--not so hot--during the \"1 Night in Paris\" (2004) parody. While the pimp-my-ride is in motion, she zealously \"looks for lip balm\" in her boyfriend's (Robert Ri'chard) lap. Finally, the \"actress\" atones for using the \"N\" word on the sex tape. Director Jaume Collet-Serra molds his take on the twin thing contrary to the theme of the past. Each exhibited opposite characteristics back then, whereas a pair of either good or bad can come out the womb today. However, the latter does not rule out the former. Childbirth constitutes the luck of the draw. Spectators can hardly consider Vincent (Brian Van Holt) a contemporary Quasimodo. Granted, the recluses share some similarities such as artistry, disfigurement, submissiveness, and murder. Yet, one small variable between the two makes all the difference. Vincent is even uglier on the inside than he is on the out. Collet-Serra's \"House of Wax\" pays homage to actor Vincent Price from the first remake in 1953. The film leaves obvious van Gogh puns to the imagination of the audience. Still, the choice to split the antagonist in two eliminates a vibrant twist at the end. Professor Henry (Vincent Price) Jarrod's unmasking receives runner-up, but the most terrifying one in horror movie history belongs to Lon Chaney in \"Phantom of the Opera\" (1925). As far as the new contender is concerned, the aftermath of separation surgery downplays the effect. A surgeon should know operating on Siamese twins scars them--physically and psychologically. Their father needs to call a couple colleagues--Dr. Phil to consult and Dr. McNamara to nip/tuck. Despite what the trailers said, \"Wax\" is not forever. In fact, you can rid yourself of it by burning it.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Dustin Hoffman's debut feature isn't as bad as it's reputed to be; a Spanish/Italian co-production filmed in Italy with the director using the pseudonym \"Dan Ash\"(!), the film is uneven but generally diverting and deals with a plethora of shady characters in search of a $1,000,000 hidden by gangster Cesar Romero (who, despite being third-billed - after Elsa Martinelli and Hoffman himself - expires before the credit sequence has even rolled!).<br /><br />Hoffman's performance, obviously, is nowhere near as nuanced as in later films but manages to dodge embarrassment by playing what basically amounts to an amiable klutz - an accident-prone American treasury agent of Sicilian descent (named Puzzu, which nobody seems to be able to get right!) sent out by his firm to retrieve the money and told to remain \"inconspicuous\" but, instead, is forever getting into trouble - though he ultimately proves surprisingly resourceful by finding the loot, foiling the crooks and winning the girl (Martinelli as Romero's daughter, who's somewhat wasted here)!! <br /><br />Still, the film's best moments are provided by suave gangster Riccardo Garrone: apart from his would-be hard-boiled persona and the hilarious use of dialect, he's flanked by a trio of nitwits who more often than not prove a hindrance in the fulfillment of his various schemes! Also, in view of the story being set in Rome, it's odd that the police officer investigating the case is a Spaniard (doubtless an exigency of the co-production deal)! <br /><br />Along the years, I've missed out on Hoffman's other Italian comedy - ALFREDO, ALFREDO (1972) - a number of times (I guess, mainly, because Leonard Maltin only rates it *1/2 in his \"Movies & Video Guide\"...but, then, MADIGAN'S MILLION gets a BOMB!); with Pietro Germi directing and co-starring the luscious Stefania Sandrelli, the credentials of that film are certainly more respectable, and I really hope it turns up again on Italian TV soon...",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I like this movie and have watched my copy twice since acquiring it a few weeks ago. But you have to view it in the right context.<br /><br />I haven't checked on the dates, but I bet this movie came out after and certainly around the same time as the Collier and Walt Disney popularisations of the vision of spaceflight being promoted by W.Von Braun. This is reflected in the attempt to seem factually correct and scientific. However, whilst certain ideas are put across ( step boosters, for example ) roughly correctly, other things are hilariously wrong.<br /><br />For example, we are told that a rocket ascends to an altitude and then turns ninety degrees to enter space...like reaching the top of a flight of stairs and turning onto the landing! Then we are told that by turning in the direction of the Earths rotation the total velocity of the ship is increased accordingly.<br /><br />This is an hilarious misunderstanding of what really happens. Most space launch centres are located as near the equator as possible where the Earth and anything on its surface is rotating at roughly a thousand miles per hour, including any rocket departing to space, in an Eastward direction ( the same as the rotation of the planet ). Of course, if the ship turned to travel westwards once in space, its speed in relation to the surface of the Earth would be greater, but it would add nothing to the actual velocity of the vehicle. Decsribed in this movie as \"air speed\"! <br /><br />Similarly, we are told that the travellers only feel free-fall, or \"weightlessness\" when they reach some thousands of miles from the Earth, outside of the planets gravitational field. Again, comically incorrect. Most crewed spacecraft travel no higher than a couple of hundred miles up, but as long as they ( and, their contents, including crew ) are travelling at an adequate velocity that their momentum in an outward direction balances the pull of gravity inwards, they will orbit in free-fall. Of course, travel far enough from Earth and even a slow object will coast outside the Earths gravity well, but in order to leave Earth orbit, outwards ( towards the Moon for example ) requires the attainment of \"escape velocity\", around twenty one thousand miles per hour. So the vehicle will have already attained \"orbital velocity\" ( and \"weightlessness\" ) by definition.<br /><br />But the movie has vastly more hilarious stuff than this. Someone decided it would be more fun if they missed the moon due to a technical problem, fell asleep for a few days and then woke up to find they had accidentally gone to Mars! The captain then ruminates to the effect that this must have been divine intervention! At which point, any pretence to being scientific is torn into little pieces like confetti and thrown upon the wind amid the merry dance of an increasingly barmy plot.<br /><br />The strength of a film like this in fact is in illustrating \"how far we've come\". Not least in attitudes to women. The patronising drivel heaped upon the female crew-member is both hilarious and also shocking.To think that such attitudes were so recently \"normal\".<br /><br />As I said at the start, I find this film very entertaining, as a late night, lights out romp through the romance of travel in outer space, from the perspective of the days before it had actually happened. An antidote to the cold routine of spaceflight as it has now become in the Twenty First Century.<br /><br />I won't reveal the ending. It is both brave and shocking for a movie of this vintage and character.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Read the book, forget the movie!",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "(spoiler warning) I seem to keep giving this guy his last chance. Strange how an action hero who once was keeps attracting an audience. Anyway, this movie is about a character (Seagal) being kind of a mysterious rough-neck hero. That's it.<br /><br />Next.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I first saw a poster advertising this film on a street in Helsinki, Finland in June of 2000. What caught my attention was the proud proclamation advising all readers that the movie, although itself French, had been \"Banned in France\". Upon returning home to New York, I discovered that one of the \"Art House\" movie theaters in the City was screening the film, and so (with my Finnish fiancee) decided to see what all the fuss was about. Boy, did we ever.<br /><br />From the comments read here, and the reviews I knew the movie was violent and sexually explicit. Not necessarily offended by either of these two conditions, I went with an open mind to see what had perturbed the sensibilities of our Gallic cousins. Presumably, as anyone who is reading this will know, the story involves two women who embark on a crime and murder spree in France (the movie has English subtitles). The resemblance to \"Thelma and Louise\" however, ends with that; the sex is unusually graphic (and in copious supply) as is the violence (a lot of stomping to death, and a lot of blood and other organic matter splattering after bullet impact).<br /><br />On an intellectual level, one could make the case that the film's very essence is the relationship of sex and violence (as manifested by the only sex these women know: one is a small-time prostitute, and the other has earned money from time to time by performing in pornographic films. When they, during their descent into crime and murder, have the upper hand over their sexual situations, they react only with the same violence and brutality that they themselves know and understand. It is important to note, however, that the victims of their rampage are not only creepy men interested in creepy sex, (of which there are several)but innocent passersby, a woman at an ATM, for example, as well.<br /><br />I myself do not really understand why the repeated \"porn-movie\" shots were all that necessary, (except to depict the physical contact as cruel, unpassionate and debased) and the unrelenting gore did get rather tedious after the first few violent spasms.<br /><br />It is a coarse and crude movie, but in fairness, it is dealing with coarse and crude people and equally unpleasant circumstances. From one point of view, the lives of the French underclasses is explored, and it's pretty grim; a travelogue for France it definitely is not- perhaps that's why the French banned it.<br /><br />",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I'm Mike Sedlak. I co-wrote the score for this movie. And proud of it. <br /><br />And I love all of the comments. Some have not gone far enough.<br /><br />The movie premiered in San Francisco in the summer of 1973. The theater was packed with friends and family. We all clapped.<br /><br />Five days latter, it was pulled from all of the screens in the Bay Area.<br /><br />If anyone is interested hearing some of scene by scene details, which might make the movie even more enjoyable, please let me know.<br /><br />We could start with the shot where Gideon Blake throws the toilet plunger to distract one of the evil henchmen guarding the radio transmitter on the deck of Bud's house. <br /><br />Or how Gideon diffused the bomb in the original version.<br /><br />Didn't help. It still bombed.<br /><br />Bring it on.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Although the story is good and portrayals what I expected of Sam Elliot my DVD copy contained almost unbearable synchronization problems. The dialogue was almost 3 seconds behind the lip movement throughout the whole film.<br /><br />I would therefore be very careful in purchasing any DVD of the film without checking for the problem.<br /><br />I would also follow the recommended censors classifications particularly in relation to language and drug usage.<br /><br />This film could become a silent classic cop movie and with the above cautionary notes I can recommend it to prospective viewers",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "When you read about this film you wanna cringe. I have seen it countless times and yet I cringe myself! So what is the attraction here? I think that for me, it's the offbeatness of the romance. I find it super refreshing to have an oddball coupling between this NYC Jimmy-Breslin-like columnist and a down-on-her-luck (health-wise) ballerina. You feel embarrassed for Paul Sorvino at his unsubtle approach to wooing this woman. Like the guy in the bar who can't take a hint. He's a bit overweight (at least as a would-be suitor for a ballerina. Hope that doesn't sound unkind) and possibly a tad too old for her. Nice change of pace from Greek God wooing Super-model. The Bill Conti score has stuck in my head all these years later, which is a pretty good sign. However some of the acting is just dreadful. A subplot involving a young Puerto-Rican boy befriended by Sorvino's character is just hilariously bad. But the opening scene where Ditchburn is warming up to Carole King draws you right into this story. Good luck finding it. You'd think that Lifetime would be re-airing this or even WE, but I haven't seen it on in quite a few years.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "only if its the last thing yo do and your humour is evaporated should you ever attempt to watch this. If you do, watch it alone invite no one, they will never return to watch another movie with you. It might be an excellent tool for that very purpose, invite people you want to get rid of in your life.<br /><br />Apparently I need to write more about his film in order to qualify as a review. This is sweet irony for this film it really does sum it up perfectly. after wasting my time it wastes more of your time. IT does have a function I take it all back.<br /><br />I recommend this film, watch it, its provocative, really go ahead watch it.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "In the 60's Cleveland television audiences could watch a episode of \"Flash Gordon\" as part of the Ghoulardi Show (11:30PM Friday). This was the best mockfest material any of us in junior high had ever seen. We would have regular \"sleepovers\" (although we did not call them that) just to get in on the fun of watching this stuff with a group of friends. Then the next week we would quote our favorite cornball lines from the latest episode.<br /><br />Watching it today provokes much the same reaction. But if you can stop laughing at the dialogue, the lame creatures, the silly costumes, and the horrible spaceships long enough, there are some good things I did not appreciate the first time through. The production designers built some excellent sets, both the rooms and the laboratory devices. Charles Middleton's \"Ming the Merciless\" character was the all-time best screen villain, certainly up to that time and arguable better than anyone since. Jean Rogers is staggeringly beautiful.<br /><br />Then again, what do I know? I'm only a child.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "So this guy goes into a psychiatrist's office for his first appointment. After the paperwork is done, the psychiatrist says \"I'm going to show you ink blots. Tell me what you see in them.\" \"Well, says the patient,\" looking at the first one, \"I see a man and a woman having sex.\" On seeing the second one, he says \"I see two women having sex.\" On seeing the third, he says \"I see two men having sex.\" On seeing the next one, he says \"I see two men and two women having sex.\" The psychiatrist puts down the the inkblots. \"So,\" he says, \"We'll start by discussing your monomania.\" \"MY monomania?\" says the guy. \"And you with all these dirty pictures!\" That's how this movie strikes me.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I honestly thought this movie was going to be cheesy, even though I've liked Alvin and the Chipmunks for a LONG TIME! I was was very wrong. IT WAS GREAT!!! It has been the best movie I have seen since October! In my opinion, it's the movie everyone should see this holiday season! Enchanted (I thought anyway...)was awful, The Golden Compass was alright, but the ending was pretty crappy to His Dark Materials fans, and I Am Legend, well I haven't seen that yet (or National Treasures 2) but it looks alright.<br /><br />I'm not about to give anything away, but this movie is great for anyone, especially kids!",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "One of the most pleasant surprises of this early 3-strip Technicolor short was that a ballet dancer that appears here was named Maria Gambarelli! I half wondered if Blake Edwards was naming the character played by Elke Sommer in A Shot in the Dark after this now-forgotten performer (though the spelling of the Sommer character's surname was actually Gambrelli). I watched this on YouTube mainly to see an early Judy Garland appearance as we watch her in profile with her two older sisters singing \"La Cucaracha\". That was the highlight for me which otherwise showed some dances (like that of Ms. Gambarelli) that were enjoyable and some lame comedy between Andy Devine as a great bull-fighter (yeah, right!) and Buster Keaton as a bull owner who provides one that is obviously a man in animal costume. Only funny part of those two is when they cry-with Buster providing handkerchief to \"bull\"-during the sad part of \"La Cucaracha\". Also lame was seeing Ted Healy without his stooges dealing with a crasher who keeps mistaking Healy for other movie stars. (Healy himself didn't know Zeppo had left The Marx Brothers since he puts \"Four\" between \"The\" and \"Marx\"!) Speaking of a Marx, it was interesting seeing Harpo without his wig though he is wearing a hat to hide his bald head. Also interesting was seeing Ida Lupino among the cowgirls in the beginning though I also recognized Toby Wing from her part in Murder at the Vanities last year (at least when announcer Pete Smith identified her). Oh, and Smith himself wasn't funny with his wise-guy narration. Other famous stars you may or may not recognize are also in cameos and not all are M-G-M contract players either! So with all that said, La fiesta de Santa Barbara is worth a look for anyone curious about Judy Garland's early film appearances or the early use of 3-strip Technicolor.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "This owes a great deal to the plot of CAPTAINS COURAGEOUS. Although he is quite grown up, it is partly the story of a wealthy lad who is shanghaied as a crew member aboard a cargo vessel and becomes a man in the process. Moran of the title is a boyish young woman also brought up on a vessel owned by her father. When the cargo burns, she and crew members are evacuated to our lad's ship. However, the captain has smuggling on his mind and his intentions are not honorable where Moran is concerned. The inevitable ensues - our lad falls for the mannish Moran and she for him. In the end evil is subdued and the lovers are united. Some interesting dialogue points out that Moran belongs to no man -\"and no woman.\" (A nod to Sappho here). Dorothy Dalton is appropriately sexless as Moran and not too attractive either. Valentino does well in a romantic, action role. His sexy build and physique are shown off to advantage and the role is quite a masculine one. He is very appealing. This is no great film but it passes the time. What it really showcases is Valentino's beauty and sexiness.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "From what I understand, Fox was embarrassed they released a PG-13 Alien/Predator movie not so long ago. It was not well received by any means.<br /><br />Not exactly sure where to go next, seeing as they thought Anderson was the best director for the franchise and they had produced a true sci-fi gem, Fox turned to it's small, but knowledgeable group of monkeys for answers.<br /><br />These monkeys were by no means veterans of writing sci-fi flicks, but had seen Burton's Planet of the Apes remake and House of the Dead. <br /><br />Their first task: hire actors. Fox gave them a reasonable budget but the monkeys wanted to save the money. They hired fifteen TV actors shortly after.<br /><br />Now, the script. The monkeys wanted to save more of the budget so they wrote the movie themselves. Leaving out important aspects of the two franchises was the easy part. Thinking of great new lines for the general audience to remember years down the line - that was more difficult. They butted heads awhile and came up with a truly award-winning screenplay equipped with cliché characters, idiotic decisions an gaping plot holes.<br /><br />Fox was pleased thus far with the results but wanted to see what was to become of the centerpieces to the film - the aliens and predators. The monkeys again wanted to save money in the budget so they decided to trash the great robotics used in the otherwise terrible AvP original and go with the man-in-the-suit Alien seen in the old films. The actors playing the aliens had trouble fitting into the suits as they weren't properly sized by the monkeys so they jiggled their plastic heads throughout the film with honor. As for the predators, the monkeys decided one predator was enough this time around (again, saving budget) to fight the hordes of aliens that seemingly come out of nowhere. <br /><br />But what about the effects, you ask? Come on now, people. They may be monkeys but they clearly knew CGI would play a key role in the film. Without diving into the budget, the monkeys used a standard Final Cut program and cut and pasted some very nice fire and spark effects throughout. Putting red and green filters over the camera lens provided some excellent Predator visions.<br /><br />The setting was something the monkeys thought long and hard about. If this was to be on Earth, in Colorado of all places, they needed to make it realistic. This was where they admitted they might have made a mistake. See, the monkeys didn't have proper training in this department so they thought turning the lights off in the city and having the movie play out in the dead of night and in the rain was the right thing to do. They simply forgot people like to see the creatures instead of looking at shadows and rain the whole film. To add insult to injury, the monkeys accidentally filmed all the fight scenes incredibly close so no one could see what was fighting or who it was. But again, rookie mistake.<br /><br />The rating. Fox told the monkeys to make the movie R-rated. That was easy. Without showing how many of the injuries or deaths actually happened, the monkeys made a habit of showing the carnage after the fact. It was simple: the viewers got the gore they desired and the monkeys didn't have to film the majority of action shots involving that violence.<br /><br />Some of the actors originally had questions concerning the screenplay. Why does a blue liquid the Predator has endless amounts of magically disintegrate whatever he wants it to and nothing more than that? Why is an ex-convict driving around in a police car the entire movie? Why did the monkeys forget to show a full body shot of the Aliens? Why does a clock play a more memorable role than any of the main characters? The list of questions just kept growing but the monkeys ignored them and finished their masterpiece. <br /><br />Fox was thrilled with their work. So thrilled that they opened the movie nationwide on Christmas Day and even spent a few bucks advertising it the week before it came out. The monkeys had successfully made another installment in these cherished franchises.<br /><br />But some ask, what ever happened to the budget the monkeys forgot to use? They put it towards their next film: Aliens vs. Predator vs. Hulk Hogan. They knew the general public would be upset with the title but they have since released this statement:<br /><br />\"To the people- do not worry about our upcoming film. It will be rated R and will have violence.\"<br /><br />And everyone lived happily ever after. The end.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I don't care what anyone says, this movie is hilarious! It combines the bleak seriousness of Threads with an anarchic blend of alternative comedy, and the results are a severely dark, but outrageously funny satire on the brinkmanship policies of both the Western and Eastern blocs at the time. You gotta give the filmmakers credit for even attempting to top the real life lunacy of \"Duck and cover\" or \"Protect and survive\"!<br /><br />Imagine someone made a movie based on the Dead Kennedys track 'Kinky Sex Makes The World Go Round', and you're pretty close to Whoops! Apocalypse. Add Rik Mayall on top form as an insanely OTT SAS commander and you've got it exactly. A worthy companion piece to Dr Strangelove, and that's saying something.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "It's not Citizen Kane, but it does deliver. Cleavage, and lots of it.<br /><br />Badly acted and directed, poorly scripted. Who cares? I didn't watch it for the dialog.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I don't usually like TV movies, I reckon that if the thing was any good it would make it to Hollywood. This one though is better than average, pretty high production values, a few interesting story twists and some nice shots of NYC (along with Toronto) hold the interest.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Okay, so Ghoulies 4 is kind of bad. And it doesn't really even have the ghoulies in it. And the acting is bad. The storyline is stupid. But I forget to mention how funny this film is. It is so campy, and so ridiculous it is too fun not to enjoy. There are only 2 ghoulies in the movie, and they don't really seem to be in relation with the Ghoulies in the other film. But they are pretty funny. And funny thing, that Jonathon Graves returns for this one. If you saw the first, he was a character in that. In my opinion, this is better than the first. There are some classic scenes and some classic lines, one which is in a grocery store. \"Attention K-Mart Shoppers!\" Watch this if you enjoy bad movies. It's so bad it is good. And did I mention Barbara Alyn Woods is hot?",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "This game is not exactly the best N64 game ever. Sure, it's good, but only when there's 4 players. Without 4 players, the only fun thing to do is take remote mines and see how many people you can kill. But half of this game are levels where you have to save Natalya, so you'll have to limit your use of remote mines in those levels, and that gets quite boring. The graphics don't exactly reach the level of Super Mario 64 or even Mario Kart 64. And if you're talking a great multiplayer in a 1st-person shooter, you'll have to go with Perfect Dark. At least you can play \"multiplayer\" by yourself.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "This film gives a look at the suffering a family experiences at the death of a child, and the healing that can finally come to them.<br /><br />The family learns of the death of their son on Christmas Eve, 1991, ruining the Christmas season for them. They do not celebrate it again for many years. There is an interesting comment by the daughter that will remind viewers to consider the needs of surviving children in such a situation.<br /><br />The Matthew character makes a reference to Jesus, but I suspect that other comments he makes come from non-Christian sources. I wonder if any other viewers would recognize those comments. If so, it would be an interesting addition to the data on this movie.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "A young man, named Danny, has run away from home and meets a drifter, named Bix, who agrees to tag along with Danny and watch out for him... and his money. They end up in a small town where they meet Carrie - a shy, naive girl working in her father's diner. Bix starts seeing Carrie but he plans on leaving soon (because he's a drifter, see? He's no good! Understand?). Meanwhile, the town creep, Jesse (played by a perfectly casted Jack Elam), keeps showing up at the diner and bothering Carrie. Danny keeps inadvertently picking up whores left and right (because he's loaded with money \u0096 he has almost a hundred dollars!) whom Bix has to constantly chase away (there are a lot of ambiguously gay overtones between Danny and Bix in this flick). Eventually, Bix and Danny decide to leave town but trouble is a-brewing, due to Jesse the creep.<br /><br />My review of the movie itself: a terrible, dated \"Troubled Youth\" flick from the '50s.<br /><br />My review of the MST3K version of the movie: I've got to say that this is one of the best episodes of MST3K ever. The riffing is dead-on, all the time. Except for the somewhat downbeat ending, this movie is easy material for Joel and the Bots, especially Danny's constant screw-ups that Bix has to rescue him from. The host segments are pretty good too, especially the segment with the `Train Song.' Hopefully, Rhino releases this episode to home video one day.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I have recently found this film on one of my husband's VHS tapes (the blank variety which he uses to record stuff from the telly). The film looks as if it was last shown in the eighties and I don't remember having seen it since. It has not (to my knowledge) been released on DVD or VHS although I shall browse around for a copy.<br /><br />The film tells the story of three young people: two girls, one on the edge of puberty and the other much younger, and a young boy who go to live with their mother's brother and his young, mute Irish wife. His wife also has two brothers who live with them. The children's uncle is an unpleasant control freak who forces his young wife to wear a silver collar whilst she watches a marionette show put on by him and her brothers in his toyshop.<br /><br />The eldest girl and one of the Irishmen (the younger) develop a love for each other whilst they live in the same house. The girl helps her aunt out in the shop whilst her brother helps his uncle to make things in the workshop.<br /><br />There are a lot of very disturbing elements to the film. There is the uncle's treatment of his wife as some kind of dumb (literally) possession (illustrated by the collar) whilst the Irish indulge dancing, drinking and somewhat forbidden love. Interestingly, though, I have seen far more explicit themes played out in other movies made in Hollywood today.<br /><br />Makes you wonder whether the British film industry and the BBC have some kind of hidden agenda going on.<br /><br />Still, despite it not being a children's movie, there are a lot of playful, magic moments in it and the one Irishman does some beautiful paintings.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "'Doppleganger', ( or 'Journey To The Far Side Of The Sun' as it is more commonly known ) was written ( with input by the late Donald James ) and produced by Gerry and Sylvia Anderson, best known for their 'Supermarionation' television shows such as 'Thunderbirds'.<br /><br />The international space agency Eurosec discovers the existence of a mysterious planet on the other side of the sun, and proposes a manned flight be sent there. The committee balk at the exhorbitant cost, and shelve the project. But when a security leak at the agency is discovered, fearing that the Russians might get there first, the project gets the green light.<br /><br />American astronaut Glenn Ross ( Roy Thinnes ) is teamed with British scientist John Kane ( Ian Hendry ). After weeks of gruelling training, the Phoenix blasts off, heading for the unknown.<br /><br />Three weeks later, their ship crashes in what appears to be a bleak, mountainous landscape. Ross survives, but Kane is badly injured. A light is seen moving towards them...<br /><br />I will leave the synopsis here. Until this point, the film has been gripping, with excellent special effects ( by Derek Meddings ) and music by Anderson's resident composer Barry Gray ( why it has not been issued on C.D. is a mystery ). But when Ross and Kane crash land, and we discover the secret of the alien world - it is a duplicate of our own, everyone on it is the same, the only major difference is that things are reversed - it becomes less interesting, and ends with a shattering anti-climax. I think the cinema was the wrong place to do this idea, in fact Gerry & Sylvia later did something similar on their 'Space: 1999' show. Ross risks ( and ultimately loses ) his life in an effort to return to Earth - his Earth. But why? The new Earth is so similar he might as well not have bothered.<br /><br />Roy Thinnes had recently done 'The Invaders' television series, and gives a competent performance ( pity there weren't more scenes like the one where he rows with his wife ). Ian Hendry is good as 'Kane', but vanishes from the story too soon. Several actors went on to appear in the Andersons' 'U.F.O.' such as Ed Bishop and George Sewell. Blink and you will miss Nicholas Courtney ( 'The Brigadier' from 'Dr.Who' in a tiny role ). But the acting honours go to the late Patrick Wymark as 'Jason Webb', head of Eurosec. The character is not far removed from 'Sir John Wilder', the one he played in A.T.V.'s 'The Power Game'. Webb is such a devious character he is marvellous to watch. Herbert Lom's contribution ( as a spy with a camera hidden in a false eye ) amounts to little more than a cameo.<br /><br />Like I said, the special effects are marvellous, as are the sets. So the film is worth watching, but do not expect very much to happen once the action moves to the mirror planet. With a stronger script, this could have been another 'Planet Of The Apes' or - dare I say it - '2001: A Space Odyssey'.<br /><br />In Anderson's productions, he made the future seem like a great place, an adventure playground where science was cool, everyone had swank cars whose doors opened vertically, sexy women, and absolutely no suggestion that anything is seriously wrong with the world. We are in the future now and people are still watching 'Coronation Street' every other night. How disappointing. If a mirror Earth really exists somewhere, one hopes that is a better place than this one. If all the women there look like Lynn Loring or Loni von Friedl, I will be on the next flight!",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "A wonderful semi-humorous homage to Expressionistic black and white films of folks like FW Murnau, Fritz Lang, Carl Dreyer, Marcel Carné and others. Allen plays a character caught in a Kafkaesque nightmare, at first thinking he is part of a vigilante group trying to catch a killer and slowly realizing that he might be a suspect. The writing is a little forced (this is, after all, Woody Allen trying to be a coy Kafka), but the point is made, and no harm done. The cinematography is interesting, about 100 shades of gray, but make sure you watch in a very dark room with a good screen, or details will get swallowed in the fog. This is an amusing little movie with a few laughs that are actually snorts of \"uh-huh\". The acting is fine, considering the odd vehicle, and it's worth watching if you are big Woody Allen fan. Also of interest to those knowledgeable about Expressionistic films. I'd give this a 6.5 out of 10.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Basic summary: Ipswitch used to be a community of witches and escaped the Salem witch hunts by forming a covenant of secrecy. The first born males descended from these families have supernatural powers, and must come to terms with the seductive, addictive nature of using those powers.<br /><br />Well, I usually give movies the benefit of the doubt and start from a 5, going from there:<br /><br />Production: -1 for very obvious audio out of sync, +1 for nicely done special effects, the darkling actually gave me chills, +0.5 for nice colorization (I like the dull blue), -0.5 for the stupid sound track, +0.5 for the opening sequence -- I'm a sucker for stylish compositing and flashy title design.<br /><br />Story / Script: +1 for decent main idea, -0.5 for DBZ/Matrix/Street Fighter ripoff/pastiche, -1 for not explaining some plot threads very well (spiders, darkling), -1 for boring, predictable ending, -1 for gratuitous exposition, both as words on the screen and as bland monologuing<br /><br />Acting / Characterization: -0.5 for bad bad acting, although it gets a little better as the film progresses, -1 for lack of character development, especially among all the females<br /><br />Other: +1 for gratuitous male and female nudity, which is fun to watch, and +0.5 for no sex scenes, which for this genre are usually done very badly and end up being boring rather than hot, +1 for hitting its target audience, teenage sci-fi/horror/thriller fans, even though this movie is not exclusively any of those genres.<br /><br />Conclusion: This is not a \"film,\" this is a MOVIE. There's really nothing to analyze, it's just good, (relatively) clean fun. Lots of really attractive actors and actresses. Lots of boys fighting in the style of DBZ and Street Fighter. If you like cute actors and actresses, supernatural special effects, and/or mindlessly fun plots, this movie is for you. If you prefer Oscar-worthy, exquisitely-produced film masterpieces with tons of multi-layered, allegorical plot threads and groundbreaking visualization techniques, you probably won't like this film.<br /><br />Using my twisted logic, this movie gets a 4/10.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "This neo-film noir is one of a genre of late twentieth century American films that all seem to involve corrupt characters, fast cars, a ribbon of highway and, of course, plenty of guns wielded by people who appear never to have taken a gun safety course. The actors are the best reason to see \"Black Day, Blue Night.\" There is the late, great J.T. Walsh (\"Swing Blade,\" \"Pleasantville,\" \"Red Rock West,\" \"The Last Seduction,\" and many more), who did many neo-films noirs (See also \"Breakdown\"). Then there is Michele Forbes of the TV series \"Star Trek: The Next Generation\" and \"Homicide.\" (In a supporting role, there is even the late Bejamin Lum who also appeared on a Star Trek episode titled \"The Naked Now.\") A spoiler of sorts--a clue really: Only the most innocent survive, but innocence is a very relative term in a movie like this, and you probably won't guess who is innocent before the final reel.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "One of the more obscure of Anthony Mann's Westerns, The Last Frontier was also his only cavalry Western (aside from one brief episode in Winchester '73), though naturally he focuses on the outsiders and internal conflicts rather than offering a Fordian celebration of comradeship and shared ideals. Set not in his beloved high country but in the foothills and forests, it's a much more cynical view of life of the frontier, in many ways his Fort Apache without the need to preserve the legend: this outpost is made up of misfits, failures, cowards and the odd competent officer ignored by his superiors, badly led while the Civil War takes priority and all the best the army has to offer.<br /><br />Victor Mature and James Whitmore are the free trappers who find civilisation creeping up on them when they are relieved of their pelts and packhorses by a local tribe aggrieved by the incursion of the Cavalry into their territory. Rather than blame the Indians for their losses they decide it's the army's fault for building the fort and decide to demand compensation from them, ending up joining their ranks as scouts instead. But despite the best efforts of Guy Madison's amiable and competent acting commander to bring Mature into the 19th Century and make him fit to wear the uniform, the arrival of Robert Preston's humiliated Colonel eager to revenge himself on the tribe that drove him out of his own outpost \u0096 and Mature's clumsy infatuation with the Colonel's wife (Anne Bancroft, too much of a blank slate here to do much with the role of a woman who's tired of being saved by men who think they know what's best for her) \u0096 soon drive matters into much darker territory. It's not long before some of the soldiers are busily planning on killing each other, both sides trying to goad their subordinates into doing the deed for them: little wonder that at one point Mature throws away the bluecoat he has long coveted in disgust, screaming \"I would have died for this, but it's nothing but a dirty filthy blue rag!\" The Stallone of his day, Mature was one of those actors who could surprise you with the odd excellent performance here and there when matched with the right part and the right director. This is not one of his better days despite having his most complex part, perversely enough as a simple man \u0096 well-meaning but drunk, violent, uneducated and with a unsubtle, almost childlike lust for life, the part seems designed with Burt Lancaster in mind, with some striking similarities to his character in The Kentuckian. But Robert Preston's Ahab-like Colonel is clearly the best role, determined to resurrect the career he destroyed in a single disastrously suicidal Civil War engagement by launching another pointless suicidal campaign against the tribe that added another humiliation to the list that keeps him out of sight and out of mind of the promotion board. In his obsession to redeem his career he moves further away from any hope of moral redemption, driven as much by his sense of shame at his wife's sympathy as by the promotion of former comrades he regards as his inferiors. He's beyond salvation, but there's still a recognisable human being in there and one not entirely without a sense of integrity \u0096 he genuinely admires Madison's courage in making a futile attempt to get Preston's orders countermanded by their superiors \u0096 fatally skewed though it is.<br /><br />Like its hero, the film is a little rough around the edges (and boasts one of the most surreal and jaunty title songs of any Western), but that only tends to make it more interesting, and there are plenty of Mann's typically elegant camera moves and plays on perspective, while the frontier setting is convincingly harsh and primitive. Unfortunately the deficiencies of the early CinemaScope lenses are very apparent in Columbia's DVD, with the image often dark (2.55:1 CinemaScope required a huge amount of additional lighting and early Scope films show a lot of trial-and-error) and grainy.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I'm going to make this short and sweet. It's not surprising that you had no use for this film. This is a story about the power, beauty and possibilities inherent in a meaningful education. Based on your pathetically composed comments I can see that your own education has been woefully neglected... or worse... completely wasted. Your comments are those of a truly ignorant person. I would advise you to do something about this condition... but in your case I feel it's probably too late. My hope is that you yourself don't intend to go into the teaching profession ( especially in Film Studies) because you could only do damage. Oh... one last bit of advice. In the future, if you intend to write more opinion pieces, you should really proofread your work. It will make people take you more seriously.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "The Italian Job requires daylight hours and no experience is required. This is a great matinee and a good afternoon at the movies. The plot is good, but the actual playing out of the plot is very simple and requires no thought process. It's car chases, explosions and all for the simple purpose of defeating \"the bad guy\" played by Edward Norton. For Norton, it seems he is content to portray the exact same characters as in his previous films such as \"The Score\". Mark Wahlberg and Charlize Theron deserve better scripts. Warning: If you've seen the trailer, then you have seen the movie. If you're looking for entertainment at inexpensive prices then you need The Italian Job.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Heftig og Begeistret (Intense and Enthusiastic) is a documentary-like story of a male choir up in Berlevåg in the very northern part of Norway, where the weather is cold and hostile, the days are dark during the winter and the towns are faced with young people moving to the more populated parts in the south of Norway, where the climate is warmer and there are more opportunities.<br /><br />The most beautiful part of this movie is the humans themselves. The people in the choir, who are aged from 30 to 95, all have unique, colorful lives and are very enjoyable beings. They are characterised by the harsh climate and the recession of the North and have adapted to the way of living required. Throughout the movie, we learn a bit about many people in the choir and we follow them through songs, some events in a church and on the harbour, and in the end, a trip to Murmansk.<br /><br />The outside environment filmed in the movie is very beautiful and characterised by the Norwegian nature. The scenography is also natural and taken directly from the choir and from the peoples lives that we meet. Thei r livingrooms, the bathroom, the kettle on the oven; there is nothing artificial about this movie, not the people, not the environment, not their music and not their feelings. Everything is as real as can be.<br /><br />It all loses out though when it comes to giving a story. It is very beautiful and real, but why do we see it? Is it because of the songs? Is it because of the nature? Or is it simply just to see a story about Berlevåg Mens-Choir, about their life and some of the trips they have. The message, if there is any, is that this small society copes with life through such social events like the choir. The choir have kept the people together for many many years.<br /><br />It is all nice, but being as popular as it has been, seen by almost 200.000 in Norway, there is something wrong. There is no beginning or end to it. Nobody gains or loses anything, nobody reveals any message or tries to convince the audience of that this is good or that life up there is great. Why was this movie made?<br /><br />I am sorry. It is a nice movie about good people, but compared to the average European, Scandinavian or Norwegian movie - this does not deserve a 9 out of 10. It is closer to 4 out of 10, and that is what I will give it.<br /><br />If you see this movie in a theater, you should expect the average age on the audience to be around 55-60. It has reported to be consistently high in all theaters. Maybe this is also the reason for it receiving such very high praise in the news and good grades also on the IMDB: It is a movie about elders, for elders. It is a movie of \"I regret nothing in my life\", and a story saying that living in a small town like Berlevåg, might be a nice life too.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Ok, let's get this out of the way first: As a piece of cinema, Lifeforce is rubbish. As a bit of cheesy entertainment for SF buffs, it's got a lot of merit. If you enjoy watching those old black and white SF B-movies - giant mutated spiders/ant or alien monsters wandering around the desert - you really will get a kick out of Lifeforce.<br /><br />Bad things: The story makes little sense and the acting is pretty poor. Good things: The special effects are halfway decent; it has a welcomingly different British centered story (it's set in London) which gives different feel to most SF movies; and it has the well-endowed Mathilda May (amusingly billed as \"Space Girl\") wandering around stark naked. <br /><br />In short: it's fun. <br /><br />I've seen it half a dozen times now, and every time it comes on TV I make time to watch it - admittedly this is partly to do with the naked Ms. May - but it's also to do with the enjoying a bit of unassuming and silly SF.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "<br /><br /> It's common knowledge and has been said before: No one can ever play Scarlett and Rhett like Vivien Leigh and Clark Gable. Joanne Whalley Kilmer (no longer Kilmer having been divorced from ex-hubby Val Kilmer) plays her own Scarlett and although this is a sequel and not a re-make (God-forbid!!!) she still cannot rise to the occasion (i.e. her voice sounds evil on several occasions, she's got brown eyes [Scarlett in both novels had green eyes and even Vivien Leigh's eyes were green] and her vocal power was not up to the job either. Scarlett is a Southern Belle; therefore she has an incredible talent for flirting (as she did in SCARLETT the novel and GWTW, of course) and to be a great flirt like Scarlett is, you would most likely need a higher-pitched voice, like Vivien Leigh.<br /><br /> I suppose I'm comparing Kilmer to Leigh a bit too much but when someone possesses a role so masterfully as Leigh did with Scarlett you simply can't help but to criticize any new prospective Scarletts. Timothy Dalton should have had no accent whatsoever, due to the fact that both Margaret Mitchell's Rhett and Gable in the film had none. His acting has never been truly noteworthy (except, maybe his portrayal of the evil, conniving King Phillip of France in THE LION IN WINTER) and he gives very little (if any) freshness or vitality to his Rhett. <br /><br /> Standouts in the cast are most notably Tina Kellagher (a born actress with plenty of authenticity in her deliverance) as the tragic victim Mary Boyle. And then of course there's Sean Bean as the cold, calculating and not to mention, almost demonically evil Lord Fenton, Mary's nemesis and Scarlett's eventual violator. One thing I could not forgive the writer for was the fact that Scarlett is raped in this movie (a fact that never occurred in the novel; Lord Fenton is cold and of ill-repute among the Irish in the book but he's nowhere near as heartless as his screen counterpart. Another omission from the novel but readded for the film is the character of Belle Watling, played most horribly by Ann-Margret in a cameo role, which we all could have lived without, seeing as how the book was such a run-away bestseller without requiring any assistance from Ms. Watling.<br /><br /> For a film by itself, SCARLETT is a very good one but not quite in that lofty of a place in terms of being GONE WITH THE WINDs sequel. Another actress was highly necessary for Scarlett as well as Rhett.<br /><br />",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "THEIR PURPLE MOMENT <br /><br />Aspect ratio: 1.33:1<br /><br />Sound format: Silent<br /><br />(Black and white - Short film)<br /><br />Two luckless nightclub revellers (Laurel and Hardy) are unable to pay their bill, provoking violent retribution from a hot-tempered waiter (Tiny Sandford).<br /><br />Typical L&H scenario, less substantial than some of their best work from this period, but worth a look nonetheless. Stan takes center-stage this time round, caught up in a financial dilemma after holding back part of his wages to fund a night on the town, only to find out - too late! - that his aggrieved wife (Fay Holderness) has replaced his stash with worthless coupons. Some of the prolonged closeups of Laurel as he slowly becomes aware of the unfolding disaster reveal his genius for characterization and mime. 1920's morality is represented by Patsy O'Byrne, playing a hatchet-faced busy-body who takes great joy in alerting L&H's respective spouses (Holderness and Lyle Taho) to their husbands' bad behavior. The ending fizzles, but the movie still has much to recommend it. Directed by James Parrott.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I've read through a lot of the comments here about how this movie sticks to the book.. I don't think any of them have actually read it. Edgar Rice wrote about a dangerous African Jungle and Apes were killers and hunters. We know differently now and this movie portrays Apes in a more modern view. I've never seen a Tarzan movie that even comes close to Edgar's vision. Maybe one day Hollywood with trust talented and respected authors to tell the story. So, if you've never read the book and enjoy a good story about feelings and a fluffy bunny view of wild animals, maybe a good cry, see the movie. I hope John Carter of Mars get's more respect than Tarzan has. We miss ya, Edgar!",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "A film that reveals the unease of modern men and women in life when confronted to death. We are beyond the simple religious belief in the afterlife, and what's more in any kind of hell or heaven. Religion is declared dead. Yet human beings are more obsessed than ever by death, especially since we can push it away for quite a long time. What's more the scientific and technological development of our societies leads us to believe we can explain everything, know everything and do everything. That was quite typical of the end of the 20th century. Today things are changing, especially when the president of the United States himself, Barack Obama, in a public speech to journalists speaks of their search for truth and qualifies that truth as being of course relative because it is more a quest than a final end, objective or achievement. The film shows the end of the good old metaphysical thinking that was starting to evolve into a truth obsession, an obsessive conception that truth was unique and irreversibly reachable. Post modernism had not reached Hollywood yet, though today it seems to have reached the White House. So some young doctors and medical students decide to go into death and come back. Technically it is possible but the result is not surprising. It reactivates old guilty feelings and frustrations that had been buried into the unconscious. One has to do with a drug addicted father of a Vietnam veteran who commits suicide, another with a young boy who was stoned to death by some others the death tripper included, another still with a young black girl who was victimized and bullied in grade school out of racism, sexism and hatred if not fear in front of her shyness. It is so naïve that you could cry out of shame for these young adults who are highly qualified and behave like babies who are crying for their bottles of edulcorated fruit juice. The film though is interesting but in something quite different. The setting and the shooting and every single detail or treatment of any detail is baroque, morbid, decadent, quite in the style of \"Death in Venice\" or Greenaway, or some other works of art that deal with making friends with the basic enemy that death is. Of course that does not save the film but at least that makes it worth watching.<br /><br />Dr Jacques COULARDEAU, University Paris 1 Pantheon Sorbonne, University Versailles Saint Quentin en Yvelines, CEGID",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Although the video box for many copies of this film claims it is about people turned inside out, this is a total lie. In fact, apart from the opening segment, the film isn't even a horror movie. With its sunken treasure, legions of fish people, and mad scientists, it's a lot more like a Doug McClure adventure movie. Obviously, this film is no work of art, but it's kind of fun to watch... Just be warned that the beginning is quite gory.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I appeared as an extra and was on location as a journalist covering \"The Dain Curse\". My involvement was during the segments of this film shot in Jim Thorpe, Pa. (Jim Thorpe was also one of the locations of the 1969 film \"The Molly Maguires\"). I reported the 'action' in the Emmaus Free Press newspaper where I was editor 1978-80 (the paper ceased publication int he 1990s). I recall the excellent attention to detail of the period costumes, automobiles, etc. The modern asphalted streets of Jim Thorpe were covered with gravel to mimic a 1920s rural town of the south. At the time, I interviewed the producer and spoke briefly with the director during a set change break; I did not get to interview James Coburn which was always a great disappointment to me. As an aside, I appear briefly in one of the street scenes wearing a snap- brim hat and a tweed jacket. The producer asked me to \"jump in\" and it was a real thrill. I still have a collection of black and white stills I took of the production work for the newspaper. Someday, they may be of interest to film/television historians.--Lou Varricchio",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I had no expectations when seeing the movie because I was seeing it with a bunch of friends and had no idea what it was. Some parts were silly and some parts were lame, but overall the movie was worth watching. I like goth looking women; this movie has plenty of it. The fangs do look really lame though.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "A bunch of mostly obnoxious and grossly unappealing teens go to a creepy, remote, rundown old mortuary located nearby a cemetery to attend an anything-goes all-out Halloween party being hosted by freaky occult-obsessed oddball Mimi Kinkade and her vacuous, boy-hungry bimbette friend Linnea Quigley. The loutish, profane, beer-guzzling, sex-happy dipstick dimwits hold a séance as a joke (very bad idea, 'cause the desolate old dive is naturally said to be haunted by demonic spirits). Of course, that ill-advised séance awakens those decidedly grumpy and hostile evil spirits, who gruesomely kill and possess a majority of the kids, turning them into ugly, fanged, clawed, boil-faced murderous ghouls who wreak the usual grisly havoc throughout the duration of an especially long, dark and harrowing night of pure terror.<br /><br />Yep, this is essentially your umpteenth vigorously graphic and unrelenting wall-to-wall cheap shock-ridden \"Evil Dead\" rehash, replete with closed-off, there's no easy way out claustrophobic single self-confined setting, outrageously excessive splatter set pieces, an incessantly pounding hum'n'shiver synthesizer score, a total sense of gloom'n'doom-laden grim nightmarishness, and vibrantly in-your-face manic careening cinematography (the expected headlong rush-inducing hyperactive hand-held camera-work, smooth, sinuous tracking shots, crazily tittled camera angles, even the camera on a dolly doing a gracefully gliding 180 degree figure eight). Fortunately, Kevin S. Tenney's slick, assured, stylish direction keeps the extremely threadbare and derivative proceedings thundering along at a speedy clip; moreover, Tenny gives the film an attractive polished look and effectively creates a certain crudely energetic and enthusiastically grotesque spooky ooga-booga carnival funhouse atmosphere.<br /><br />However, Steve Johnson's marvelously gory and imaginative make-up effects are the true star of the show. Bloodthirsty highlights include disgusting fat slob Hal Havins (who played a similarly irritating obese a**hole role in the immortal \"Sorority Babes in the Slimeball Bowl-A-Rama\" around the same time) having his tongue bitten off, Quigley shoving a whole tube of lipstick in one of her breasts (yow!) and gouging a guy's eyes out while she's making love to him (double yow!), a libidinous teen couple getting offed while doing exactly what you think in a coffin (the chick has her neck snapped while the dude has his arm chopped off), Kinkade setting her hands on fire, and, in the film's single most nasty scene, a mean old man has his throat slit from the inside out after eating an apple piece laced with razor blades. The trashy'n'thrashy rock score likewise smokes. And then there's Kinkade's incredibly wild, sexy and uninhibited demon dance, a sizzling number accompanied by a flickering strobe light and startling jump cuts that Kinkade choreographed herself. Okay, so this overall doesn't amount to anything more than a completely mindless and pointless, albeit quite nicely mounted and enjoyably vulgar hunk of blithely sleazy fright flick junk, but if you're in the mood for entertainingly brain-dead lowbrow horror scuzziness this cheerfully crass and juvenile dross does the trick just fine.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "First off let me say, If you haven't enjoyed a Van Damme movie since bloodsport, you probably will not like this movie. Most of these movies may not have the best plots or best actors but I enjoy these kinds of movies for what they are. This movie is much better than any of the movies the other action guys (Segal and Dolph) have thought about putting out the past few years. Van Damme is good in the movie, the movie is only worth watching to Van Damme fans. It is not as good as Wake of Death (which i highly recommend to anyone of likes Van Damme) or In hell but, in my opinion it's worth watching. It has the same type of feel to it as Nowhere to Run. Good fun stuff!",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I remember catching this movie on one of the Showtime channels. What stood out for me is that this movie takes place entirely in Phoenix, Arizona. I'm from there so I spot the locales easily.<br /><br />Regardless, a ninja kills a scientist, because they wear yellow sweaters and golf, who is pursued by the police. It takes about half the police force to take him down and when they do eventually kill him, there are no discernible bullet wounds. His spirit lives on however when a woman finds her and touches his katana.<br /><br />From then on, she periodically gets possessed and kills the police officers who killed the original ninja. Then another ninja from Japan comes to kill the evil ninja. This might be a plot device from the previous two films, or perhaps a plot hole. All I know is that this movie is very campy, bad and entertaining. This is something to watch with a tub of popcorn, and several friends and give it the MST3K treatment.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "To summerize this movie: nice for TV but too small for the theatre. I enjoyed watching this movie at home but I wont watch it a second time. The concept is good, but what ends up in the movie is just a summary. The end had a 'nice' twist but is still unsatisfying. Maybe it was the intention of the director but it wasn't worked out like a it should be. But then again, it's an OK kind of movie.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Some TV programs continue into embarrassment (my beloved 'X-Files' comes to mind.) I've been a fan of Dennis Farina since 'Crime Story,' another late, lamented show. 'Buddy Faro' never had a chance. The series had a good premise and great actors. It's really, really a shame.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I missed the full four hour version when it was originally released in theaters because it played one week. I had to settle for seeing the shorter two and a half hour version a year or so later and was left stunned by what I saw. I left the theater thinking I had witnessed a masterpiece and wondering what the full version was like.<br /><br />The full version is mostly good but it has sequences that are so incredibly dull that the whole movie is pulled down and almost sinks beneath the waves.<br /><br />The problem is entirely in the editing which should be labeled as the final word on excess. There are times when things go on and on and on and nothing happens. Shots of people in a city that go on much too long with no purpose in the narrative. We get beautiful vistas and visions of such beauty that they bring tears to your eyes but they are used too frequently as a place holder instead of as punctuation or to set a place. Much of the longer version seems to be on screen simply because it looked good.<br /><br />I've attempted to actually sit down and watch Heavens Gate with out resorting to the Fast Forward button but somewhere along the way I find I can't stand it any more.<br /><br />I wish MGM would take pity on us and release the shorter version to DVD as well as the huge dinosaur. Perhaps as a two pack so that we could see which is the better version, and whether Cimino was mad or not.<br /><br />And while they were at it why not include the once rumored Johnson County War edit that ran 90 minutes. Supposedly United Artists tinkered with a further cut in the hopes of getting some of their money back. Whether it was ever done or still exists is up in the air, but it would be interesting to see.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Childish storyline ripped off of a lame Hollywood movie, terrible acting, cheesy dialogue, and not quite \"up-to-par\" sex scenes. That's right another great softcore parody! I enjoyed this film greatly! Sure the acting is terrible, but that part of the fun! The storyline is ludicrous, but some things must be sacrificed when the story has to revolve around girl-on-girl sex scenes. And because it's only softcore (no penetration) the sex scenes were a little bland. But it's like the great god of softcore smut Russ Meyers said \"who really cares what goes down beneath the waist.\" I don't know if I'd agree with Mr. Meyers on this one but what the hell... the flick entertained me for an hour and a half. I give it a C+, it would've been a solid B if they coulda cast more of the girls to look like Russ Meyers actresses. VaVoom! VaVoom!~",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "A wealthy young man, raised as a SON OF THE GODS, must confront his Chinese heritage while living in a White world.<br /><br />Although the premise upon which this film is based is almost certainly a biological impossibility and the secret of the plot when revealed at the movie's conclusion makes all which has preceded it faintly ludicrous, the story still serves up some decent entertainment and good acting.<br /><br />Richard Barthelmess has the title role as the sweet-natured Oriental whose life is terribly complicated because he looks Caucasian. Barthelmess keeps the tone of his performance serious throughout, gazing intently into the middle distance (a mannerism he developed during Silent Days) whenever his character is indecently misused. He makes no attempt to replicate his classic performance in D. W. Griffith's BROKEN BLOSSOMS (1919) and this is to his credit. Beautiful Constance Bennett is the millionaire's daughter who makes Barthelmess miserable. She is gorgeous as always, but her behavior does not endear her to the viewer and her terrible illness in the final reel is kept mercifully off screen.<br /><br />Multi-talented Frank Albertson has a small role as Barthelmess' improvident buddy. Serene E. Alyn Warren and blustery Anders Randolf play the leading stars' very different fathers, while Claude King distinguishes his brief appearance as the English author who befriends Barthelmess.<br /><br />Movie mavens will recognize little Dickie Moore, uncredited, playing Barthelmess as a tiny child.<br /><br />The original Technicolor of the flashback sequence has faded with time to a ruddy tint. The shot purporting to be the South of France instead looks suspiciously like Avalon on Santa Catalina Island, off the coast of Southern California.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I've got to say it. Gary Busey saved this film. If it were not for his fine acting talents this film would have been sub par. I recommend the film but just barely.<br /><br />The biggest difficulty with the film is its broad disregard for historical, geographical and physical accuracy. For example, why is Lubbock green and hilly? How come Buddy's producer Petty ignored? Where are the daily trips to the Clovis, New Mexico studio? Why is Nashville treated as a racist hate camp out to destroy the Holly sound? Why was Buddy's two week courtship to Maria treated as a complex, taboo, race mixing stereotype? Why are Buddy's tile boxes as light as feathers? Finally, why are the Crickets portrayed as trouble making roadblocks to Holly's talent?<br /><br />Taken on their face these inaccuracies should spell doom for any film proclaiming itself, \"The Buddy Holly Story.\" However, Busey does deliver a stirring portrayal as the man whose death eventually led to the day the music died.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I don't know if it's fair for me to review this. I'm not a fan of gratuitous violence. I've never understood the movie industry making heroes out of mob members and cold blooded killers. When The Godfather came out, I thought they had broken the mold, but the decades have produced a series of well-acted mob movies with major stars and directors doing them. This one is obviously low-budget, but it is certainly well done. At some point in all of these I feel like I want to take a shower. If such characters actually exist, it is hard for the soul. I always intellectualize that humankind will rise above this sort of thing. This kind of crud has to be stopped. I hope the people that go to films like this are more voyeuristic and less vicarious. I feel sort of the same way about slasher movies. Why do we have a fascination with death and dismemberment? In fairness, I am judging this on the acting and directing, and for what it is, it seems to work pretty well.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Chen Kaige lost his sense of tempo. I envy Europeans and Americans who can watch the film without following the dialog with their ears, because it is painful to do: slow, unnaturally heavy, and over-deliberate. But Westerners, on the other hand, suffer from the poor quality of subtitle translation, which manages to lose all the subtlety and double meanings that make a careful study of the film so much fun.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "This was one of the worst Columbo episodes that I have seen, However, I am only in the second season.<br /><br />The typical Columbo activities are both amusing and irritating. His cigar ashes causing him trouble have been seen before, And the bit where he always identifies in some way with the murderer--in this case cooking ,Tho the scene on the TV cooking show distracted from the main theme.<br /><br />Also not explained was why the brother at the beginning of the show was cutting part of the wires of the mixer. The reason was never explained ,nor did it serve any purpose. But the part I disliked the most was the death of the bride to be . This was never explained and it is the main reason why I give this episode such a low grade.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Ivan The Terrible is more a filmed stage play than a \"big-screen-opus\". Citizen Kane - a similar work in many ways - is quite the opposite (in the way we come to expect such fare) in that it has lots of location shooting for example.<br /><br />Acting is meant to convey a character's motivations and thinking to the audience; if it succeeds in making you understand the character, what does it matter HOW it was done? And considering the low amount of action, how else is one to express events that influence the story, and consequently the characters' machinations and decisions other than \"exaggerated movements\"?<br /><br />As well, there's a historical level why the acting style should not surprise. The rise of totalitarian regimes in Germany and USSR forced film-makers who stayed behind to make films the way they knew how. As they were prevented access to more modern works that showed cinema's evolution and techniques, they only used what they knew.<br /><br />The Nazi's control of government in Germany destroyed the great German film industry of the 1920's, due to their total control over that film industry. And propaganda films can only \"entertain\" German troops so much; hence the need for popular German silent films of the 1920's, for example. So a lot of Ivan The Terrible film's techniques would have been derived from such captured German films supplied to the film crew (as mentioned in other comments).<br /><br />There was no confusion anywhere and though personally it was found over-hyped, it is by no means a bad cinematic experience - and definitely NOT amongst the worse films ever. The acting is fine, and part of the cinematography excellent (even by today's standards; more below). Definitely not a popcorn flick; one can't leave their brain outside this one's door. Dated perhaps and very symbolic - only worth watching on the big screen if one is unable to view the films with the lights off at home, for many of the cinematic elements will be lost in these films' chiefly B&W experience. It all depends upon what expectations one walks in with...<br /><br />WARNING - SPOILERS: Do not read the following comments, in case they influence your personal view of the film(s).<br /><br />...and if one does not mind the obvious communist propaganda (as opposed to capitalist propaganda). For Ivan is how Stalin saw himself - obvious in his influence on the film's direction (see other comments) - and anyone with a world historical awareness outside the US perspective will definitely understand this. Maybe Ivan was an earlier incarnation of Stalin, or maybe not; this is more a diatribe on Stalin and his motivations, decisions, loneliness, promotions of lackeys, etc - using the persona of Ivan - than any true historical record of Ivan. Also note the obvious use of particular colours in the sequel: Red (for the USSR) in the banquet scene. And perhaps blue (for the USA) during certain shots when the usurper wears the crown?<br /><br />But it has many excellent visuals such as the profound use of shadows, or the exterior shot of the populace coming to beg Ivan's return to Moscow.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "(Some spoilers included:)<br /><br />Although, many commentators have called this film surreal, the term fits poorly here. To quote from Encyclopedia Britannica's, surreal means:<br /><br />\"Fantastic or incongruous imagery\": One needn't explain to the unimaginative how many ways a plucky ten-year-old boy at large and seeking his fortune in the driver's seat of a red Mustang could be fantastic: those curious might read James Kincaid; but if you asked said lad how he were incongruous behind the wheel of a sports car, he'd surely protest, \"NO way!\" What fantasies and incongruities the film offers mostly appear within the first fifteen minutes. Thereafter we get more iterations of the same, in an ever-cruder and more squalid progression that, far from incongruous, soon proves predictable. Not that it were, on the other hand, literally believable-- but it were unfair to tax Motorama in particular with this flaw, any plausible suspension of disbelief having fallen precipitously on the typical film-maker's and viewer's scale of values ever since \"Raiders of the Lost Ark\" became a blockbuster.<br /><br />\"Hallucinatory\": How do we know what a hallucination is if part of having one is not knowing that we are having one? At any rate, some people know that they enjoy \"hallucinogenic drugs\"-- but if Motorama typifies the result of doing so, then I'm at a loss as to why anyone would take them more than once. There is, of course, the occasional bad trip. The movie must be one of those, pun and all.<br /><br />\"Juxtaposition of words that was startling\": How many times can a ten-year-old startle you by uttering \"Oh, my God!\" when he likes something, or \"Damn!\" when he doesn't? These two interjections are about par for the course with this script. Sadly, any sense of the surreal in what passes for dialogue could only reveal, in direct proportion, one's naivete regarding the speech patterns of the rising American generation.<br /><br />\"A world completely defined and minutely depicted but that makes no rational sense:\" Motorama's world indeed makes no sense, but it is about as completely defined as a cartoon in an elementary school newspaper. The numerous guest stars in the cast all have cameo roles even less intelligent than our little hero who exclaims \"Damn!\" in the blink of an eyelash but needs several seconds to concoct the lamest lie. And even *his* character, despite appearing in nearly every scene, gets no significant development. Here's scant reward for any viewer who sympathizes, as I must, enough to wish to know him better and understand 'where he's coming from.' One vaguely senses a far better story and protagonist struggling to get out.<br /><br />\"Fully recognizable, realistically painted images are removed from their normal contexts and reassembled within an ambiguous, paradoxical, or shocking framework.\" No, we see a succession of stereotypical and ever more dilapidated billboards, filling stations, greasy-spoon eateries, cheap hotels, and their lowlife habitues along country highways, exactly where they stereotypically belong.<br /><br />\"Largely responsible for perpetuating... the traditional emphasis on content.\" There is little content, moment-to-moment, in Motorama.<br /><br />To sum up: Picture British millionaires dressed as clowns or pirates on the way to a posh costume party, sitting serene and mute as cautious chauffeurs inch their Rolls-Royces like fragile skiffs through a roiling sea of desperate humanity, Chinese who implore them through the windows and smear the glass with blood. Or imagine a stadium full of abandoned antiques, limousines like those above now rusting, and white pianos tinkled by ghosts. Into this detritus wander an exhausted boy and an ailing woman to whom he clings as mother-figure becoming girl-friend, who fall asleep side by side on the grass. He is awakened-- on the Feast of the Transfiguration, \"white and glistering\" day 1945-- by a brilliant flash on the horizon that is not the rising sun. Finding that his consort has become a corpse, he first believes that he has witnessed her soul going up to heaven. Later he explains only a little less innocently, 'I learned a new word today: atom-bomb. It's like God taking a photograph.' Now, *there* are just two samples of cinematic surrealism, surrealism whose ironies ripple out far enough to invade its film's very title: Empire of the Sun. If you seek surreal, *please* don't miss it. Alas, however hard he treads on the accelerator to race his chariot through and beyond the desert, no scenes so exquisitely strange, rich, subtle, or gorgeous await Motorama's poor little Gus in his quest.<br /><br />None of the above necessarily constitutes a thumbs-down on this film. Though somewhat disappointed, I can't dismiss it, in view of the respectability of another genre that it does exemplify-- one influenced, to be sure, by surrealism, but also by expressionism, existentialism, and Franz Kafka's pessimism amidst omnipotent power structures. Let's try on for size: Theater of the Absurd.<br /><br />Turning to E.B.'s article on this style, I am amazed by how, to the extent that Theater of the Absurd is a valid artistic style, the above objections to Motorama vanish like a puff of smoke. I'm tempted to quote the entire text as support of the identification.<br /><br />Theater of the Absurd attempts to show \"that the human situation is essentially absurd, devoid of purpose... humankind is left feeling hopeless, bewildered, and anxious.\": Having instantaneously achieved his purpose of getting away from a depressing home life among bickering parents, Gus finds himself purposeless until he drives past a glittering billboard reading \"Motorama\" and decides to win the lottery that it promises. As others have already revealed, this ambition proves illusory: although the game \"never expires\", the sponsoring corporation has no intention that anyone should ever win, and has ways to trick, confuse, and leave crestfallen any aspirant to the reward. He, like others, is ultimately disappointed in his dream.<br /><br />\"Absurdist playwrights, therefore, did away with most of the logical structure of traditional theatre. There is little dramatic action as conventionally understood; however frantically the characters perform, their busyness serves to underscore the fact that nothing happens to change their existence... a timeless, circular quality emerges.\" \"Language in an absurdist play is full of... repetitions... repeating the obvious until it sounds like nonsense.\" Underneath a sometimes \"dazzling comic surface,\" we find \"an underlying message of metaphysical distress.\" Gus's obsession with a silly game, his inane language, the plot device wherein he divines a bleak future and/or returns to an earlier moment and takes a different but still bleak turn-- so much fits now. While an admirer of the surreal would do better with some films, anyway, of Spielberg, admirers of Motorama as it really is should find fellow-travelers-- not instead but addition-- in the works of Beckett, Ionesco, and Genet.<br /><br />But one can't quite stop here. After his disillusionment with the game, Gus returns to \"Phil\" (i.e., Love), the first attendant he had met and the one person who had treated him decently, although he had also scolded him-- at a service station advertising \"Be full-filled!\". Under Phil's tutelage he learns a life of waiting for cars. We might note here that the absurdist playwright Beckett had entitled his most famous play \"Waiting for Godot,\" and that for Godot we should read \"God.\" God is one of Phil's preoccupations, too. Furthermore, as the indirect result of his previous encounter with Gus, Phil is badly maimed and goes about in a cast with his arms straight out horizontally. In the last scene, Gus, now Phil's protege, says that he wants to hear music. We hear none, but we see Phil wiggling his fingers at the end of his outstretched arm, beckoning Gus closer, and Gus responds. The End.<br /><br />Finally, on to an author whom I happen to be reading currently, the Anglican theologian William Stringfellow. If this rebel-lawyer is not acknowledged as an architect or undergirder of Liberation Theology, which is more a Roman Catholic than an Anglican movement, perhaps he should be. Police brutality and corporate greed are a cliche in cinema and literature, including Motorama, but Stringfellow supports and illuminates such sentiments with impressive warrants from scripture, tradition, and reason.<br /><br />His most significant work is an expose of the earthly activities of those fallen angels whom the Bible refers to as principalities and powers. Principalities, wrote Stringfellow, are behind all of our popular three I's: Images, Institutions, and Ideologies. All of these commend themselves to our worship by making false promises. The more deeply involved with an image, an institution, or an ideology any person becomes, the more his own personhood becomes \"depleted\" and be becomes a slave to them. Promising power, control, and immortality, they inexorably deliver helplessness, chaos, and death. As essentially fallen, defeated powers, they can do no more than that. Yet they beguile humans with that \"dominion over the earth\" promised by God in the book of Genesis, while in fact no one of us controls an image, an institution, or an ideology bent inevitably on its own hegemony and self-preservation. They take on lives of their own. \"Dominion\" happens to be a mistranslation: a more accurate rendering of the Hebrew would be \"stewardship.\" But this is a quibble beside a more fundamental problem: Most of us neglect to notice that God had delegated this power to Adam *before* the fall. We have no reason to assume that we, his descendents, still exercise it now: on the contrary, it should be obvious that demonic forces have stolen it from us.<br /><br />One might add two observations of C.S. Lewis: First, that \"man's conquest of nature\" is a mere illusion, and a ruse to cover the fact that one is really talking about the conquest of some men by other men with nature as the instrument; and secondly, contrary to popular belief, Satan is no kind of good-time Charlie. He may dangle out pleasures at first, but he is very niggardly with them and will withdraw them from any human firmly in his thrall, perhaps leaving his prey sitting in front of the fire feeling miserably sorry for himself and seething with resentment.<br /><br />Now, applying these insights to Motorama, we seem them mirrored remarkably in Gus's experience. He is, if not nice, at least a pretty little boy prior to falling victim to the Motorama game. The first signs advertising it glisten glamorously. The longer he continues, however, and the deeper he journeys towards the sponsoring corporation's headquarters, the more shabby they become. He's lonely, meeting no one else who plays the game. The stations giving out the cards have either fallen into ruins or are staffed by zombies. The people he does meet along the way are more and more ugly, deceitful, and hostile. (The fact that the principalities answer to a common dictator does not mean that they can abide one another). Gus's humanity is leached out of him as he becomes not only totally self-centered and oblivious to the needs of others but partially blinded... disfigured... prematurely aged while infantile in the literal sense of linguistically challenged. Eventually even his precious Mustang is taken from him in a crash, and he must continue in a dead man's wreck. Yet at long last, having done everything he thought was expected, he presents himself to the principality in its proud tower to receive his prize. Using the biblical power to confuse wielded by those who have built such monuments to their own vanity, its agents evade him, disappoint, insult, and finally throw him from the top floor. He FALLS long and hard, landing, finally in a body of water. In other words, in classic symbolism, he DIES. He has met the inevitable bad end of anyone who has put his faith in such a deceiver.<br /><br />But this fate proves to be only a warning look into a mutable future. He repents and returns to Phil, and upon seeing him performs the very first generous, selfless act we have seen from him for almost an hour and a half: noting that Phil is now handicapped and hardly able to insert a hose into a gas tank, he asks, \"Can I help you with that?\" Then, seeing the \"help wanted\" sign, he decides to apply for the job, explaining to the motorist with whom he was hitch-hiking that he reckons he'll get out here, because it doesn't look like too bad a place to work.<br /><br />This interpretation is conjectural, of course, and it may surprise or even outrage the film's \"cult classic\" aficionados who see quite different points in it.<br /><br />If Motorama isn't quite my cup of tea, I'm at least convinced now that it's hardly the worst film ever made.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "This is a fact that this is the 1st Saudi feature film to be shown in cinema theaters but not in Saudi Arabia for a simple reason we don't have cinema theaters in our large kingdom .. not only one cinema theater! The government forbidden opening cinema theaters after the Islamic extremists OR the religious police (or both) asked for closing it in the late 1970s & the early 1980s .. accusing the 7th art with encouraging wrong sex relationships and stuff like that .. I don't see a powerful reason why we don't open cinema theaters!! .. we have many videos stores throughout the kingdom, we watch movies in the TV from some satellite channels, we can install the \"Showtime\" set channels and after all movies in general seems harmless in many ways .. I know many people how go to neighboring countries only to watch a couple of films .. I personally went to Bahrain several times only to watch films in theaters because watching it there is big fun unlike watching a movie home. Saudis pay the most expensive cinema ticket in the world, we travel to watch movies while the rest of the world have cinema theaters around every town. This is one of the problems that we are having!! ..<br /><br />The movie is produced and presented by Rotana Filmed Entertainment which is a major company belongs to the Saudi tycoon-prince Alwaleed Bin Talal (the 8th richest man in the world).<br /><br />The movie's title is a word means literally \"how are you?\" but it is also a slang means \"what's up!\", sometimes used as a slang to say \"bad\" about something and sometimes is used as a slang to tell someone politely to mind his business & not to interfere in someone else's affairs. Anyway, I think they meant (how are you) & (what's up!) in the same time, I could be wrong though.<br /><br />Male actors are from Saudi Arabia like Hisham Abdulrahman who is very famous and has some popularity after winning 1st prize in Arabian realty show more like \"American Idol\", he works in some TV programs like the Arabian version of \"Cash Taxi\" .. the other famous actor is Khaled Sami who is funny and has a very good sense of humor .. other actors like Mishal Al-Mutairi, Turki Al-Yusuf and Ali Al Sabea are less famous and they work on some TV series shows. Female actresses are non-Saudis and they did a very good job speaking the Saudi accent .. Jordanian actress Mais Hamdan in leading role & Emeriti actress Fatima Al-Hawsani .. not that we don't have Saudi actresses but are few and not that good.<br /><br />A Saudi critic \" Rja Al-Mutairi\" who writes for Alriyadh Newspaper (the most popular newspaper in the kingdom) wrote about it saying: \"lets not expect much of the 1st Saudi feature film. It was born in unusual circumstances therefore we can't judge it under the usual standards like any other film. It is a fact that the movie hit a huge financial success in its 1st opening days only in Kingdom of Bahrain. The movie is fresh and is about a Saudi family deals (interacts) with controversial fresh issues inside the Saudi society like: women driving cars, the low-shallow thoughts about the arts, the guardianship of the society by a certain group & the differences between being conservative and being an extremist. The ideas are good but you feel you are lost in the middle of the movie. One of the movie's advantages is the beautiful music score by Rajeh Dawood which was good but sometimes it doesn't match or express what's in the picture. Turki Al-Yusuf did a great job .. his performance was the best alongside with Mais Hamdan .. the biggest loser is the leading actor Hisham Abdulrahman who came behind the supporting actors Mishal Al-Mutairi, Ali Al Sabea and Khaled Sami who did a good job within the limits of their roles. <br /><br />after all, \" Keif al-hal?\" even with all of its disadvantages still an OK movie and it is a very good 1st step of Rotana .. and the movie became the speech of people and streets which is a golden goal to make a strong debates inside the Saudi society about movies in general until they become aware of the importance of the 7th art and other arts\"<br /><br />PS: there is another Saudi filmmaker \"Abdullah Almohaisen\" claims that he directed the 1st Saudi movie titled \"Shadows of Silence\".<br /><br />I haven't seen the movie yet .. I hope I've been helpful.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "It's About Time \"Kate Jackson\" got her credit for this film.., i can remember watching it & trying to understand it on TV.., my grandmother lay in bed dying from cancer & i was barely 15. i didn't find out till years later that Richard long had died tho.., i miss him on the other shows/movies he was in.<br /><br />I have a copy of the VHS tape still but it's NOT \"CC'd\" or Closed Captioned for the Hearing Impaired & thats the ONLY flaw in the movie that i can remember or know of to date.., i haven't been able to find a DVD or VHS copy that has sub-titles in English even. If someone out there knows of either copy on VHS or DVD thats CC'd or has English sub-titles please let me know.<br /><br />thanks - Cofffeenut",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I saw this film with a live performance by the Buffalo Philharmonic, and the music was one of the two things that definitely made the experience for me; particularly, the song after the battle where the woman is looking for her husband was just devastating. The other thing that stood out to me is the battle on the ice itself, a bit of strategy ripped off thoroughly by the makers of _King Arthur_ in 2004. Also, the battle goes on forever (half an hour?)-- painfully long. I can't think of another propaganda film that makes war look less glamorous or rewarding. I'm surprised Stalin liked this film so well; I wouldn't want to go out and fight after watching it.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Italian soft X Exorcist clone.<br /><br />Woman buy statue of crucified thief. Said thief comes to life and turns out to be the Devil with rape fantasies.<br /><br />Ivan Rassimov plays the Devil brilliantly. Mostly due to his gift of evil looks. And Because he was never above doing nudity. Good on him.<br /><br />The actress in the lead did a decent job. Her wide eyed innocence and the fact that she looked great naked helped.<br /><br />This one has a similar plot element to most Italian horror films. The girl's parents are filthy rich, and depraved. Watch it to get the details.<br /><br />Laura Gemser's husband, Gabriel Tinti, also appears as a random stud. His part is basically phoned-in, but like a cheap beer, it did the job.<br /><br />Fault the director for its failings. This could have been a horror/sex classic.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Stupidly beautiful. This movie epitomizes the 'so bad it's good' genre of films. <br /><br />The only two talents in it are Richard Boone and Joan van Ark, and only Boone is any good. It's kind of sad that the man who rose to fame as Paladin should wind up in this ugly pile of celluloid. While he turns in a fantastic performance, I couldn't help but feel that he so outclassed all his fellow actors in this piece that he shouldn't even have been there.<br /><br />The effects in this film are laughable, but fun. The idea of a dinosaur being buried in the wall of a cave and suddenly coming to life is B-movie gold. When the 'triceratops' gets killed, watch how it falls. It's clear that the stunt performer in the FRONT of the costume knows the timing best. He falls to the ground, well before the back half of the dinosaur follows suit.<br /><br />Speaking of 'suits', there is nothing good to say about the purple tyrannosaur, in this flick. It seems to have some kind of stealth technology, since Bunta (reputed to be the best tracker in the world) twice fails to notice it until it's within biting range of him. I don't know how all the prints are, but in the version I own, the Tyranno's roar contains Godzilla's trademark bellow.<br /><br />This is loads of fun, to watch, if you like bad movies. I love them, and especially bad monster movies, so I consider this the gem of my collection. If bad movies are your thing, definitely get this one.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Interesting and short television movie describes some of the machinations surrounding Jay Leno's replacing Carson as host of the Tonight Show. Film is currently very topical given the public drama surrounding Conan O'Brien and Jay Leno.<br /><br />The film does a good job of sparking viewers' interest in the events and showing some of the concerns of the stakeholders, particularly of the NBC executives. The portrayal of Ovitz was particularly compelling and interesting, I thought.<br /><br />Still, many of the characters were only very briefly limned or touched upon, and some of the acting seemed perfunctory. Nevertheless, an interesting story.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Check out the two octogenarians who review Leatherheads. These guys are old-school Hollywood and a hit on YouTube. They always give an insightful and fun review. They have movie comparisons that are really interesting and they have a banter back and forth that is endlessly entertaining. They know movies, collectively they have been in the biz for practically a century. Lorenzo is a well-known screenwriter and Marcia is a famous producer. All of their insight on movies always leaves you with something to think about. See what they think about Clooney's latest...<br /><br />http://www.youtube.com/watch?v=2-W7evBEArs",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Spunky journalist Holly Hunter produces investigative news reports for a major news network. She's a motor-mouthed maverick, dazzlingly good at her job and with little time for romantic relationships. Enter William Hurt and Albert Brooks, two men who vie for her love.<br /><br />Brooks is an old school journalist who adores Holly because she represents everything good about journalism. They both believe that the media exists to test the Gods, educate the public and fight for truth. Children of the sixties, they embody hippie values. They're defenders of the public good. Knights who fight valiantly with pen and camera.<br /><br />William Hurt, in contrast, is a far more complex character. Initially awkward, clumsy and self-depreciating, he gradually reveals himself to be a sexy and manipulative high achiever, skilled at climbing the corporate ladder. Unlike Holly and Brooks, he's symbolic of modern media values: news as spectacle, journalism as entertainment, news anchor as celebrity, truth as subject to editing board. We want to despise him and his blip-time junk food journalism, but we just can't quite manage it. He's playing the game by its own rules. Do we condemn him for lacking a moral backbone? Do we condemn the game? Can the game exist if its rules are disobeyed? How have these rules evolved? <br /><br />This isn't Lumet's and Chayefsky's \"Network\", and so the film never bothers to answer or raise these questions. Content to keep things on the level of light comedy, it ends with Hurt being promoted to London Division and Brooks being booted to a tiny community network. Holly, having rejected both men, remains caught between them. The last bastion of media integrity, this spunky reporter remembers her roots, mourns the loss of Brooks and warns herself to be on the guard of future William Hurts.<br /><br />It's a cute ending, but compared to \"Network\" the film seems positively trite. Chayefsky's vision is one in which global media, despite its ubiquity, offers less meaningful information. He foresees a world in which globalisation has homogenized cultures, information has become subject to corporatisation and a handful of media monopolies control all international news. This is a world in which the truth is subject to shareholder meetings and economic interests. A world in which viewer ratings determine content and opinion polls dictate top stories. <br /><br />Perhaps this is why \"Broadcast News\", which longs for the glory days of journalism, ends on such a bittersweet note. It knows what the future holds. Made in 1987, its been living it for at least a decade.<br /><br />But today, in the digital age, things are even worse. Mergers and acquisitions have left a very small number of massive firms dominating the communication landscape. With this has come the hyper-commercialism of content, the barrier between the creative/editorial side and the commercial side all but collapsed. Today everyone might be able to start their own blog or website, but these are grass roots affairs. As the communication reach of the individual increases (due to technological progress - email, internet, electricity, air mail etc) the size of the individual's world increases likewise. He must project his voice both further and louder, futilely battling that deafening white noise, the incessant verbal static that is the global community.<br /><br />So ultimately you need two things according to democratic theory. Firstly, you need a rigorous coming of people in power and people who want to be in power, both in the private and public sector. Secondly, you need a wide range of informed opinions on all important issues of the day. In a democratic society the media system as a whole should produce this sort of culture. Unfortunately, the structure we currently have in the global system works directly against the needs of democratic journalism and a democratic society. <br /><br />8/10 \u0096 This is lightweight stuff, but a witty script, some funny moments and a brief cameo by Jack Nicholson, elevate it above most other films about journalism. Interestingly, unlike most films about the media, it never dips into satire, and instead plays things as a straight love triangle.<br /><br />Worth one viewing.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "\"Black Vengeance\" is an alternate title for \"Ying hung ho hon\" AKA \"Tragic Hero\" (1987). I have just seen this on VHS, together with the first part of the story, \"Gong woo ching\" (\"Rich and Famous\"), also 1987. (The poster and 2 stills featured on the page are for a 4-DVD set of movies starring Rod Perry (The Black Gestapo), Fred Williamson (Black Cobra 2), Richard Lawson (Black Fist). The fourth movie is called \"The Black Six\"). Strangely, while the characters retain their original names in \"Rich and Famous\", in \"Black Vengeance\" Chow Yun-Fat's character is named Eddie Shaw, Alex Man (Man Tze Leung) is Harry, and Andy Lau is called Johnny. Also confusing is the fact that 1994 is given as the copyright dates on both films. Perhaps that was the year they were American-dubbed. According to the release dates given on IMDb \"Tragic Hero\" was released before \"Rich and Famous\". Was there any reason for releasing the sequel first? Despite some users' comments, I enjoyed these films, although they aren't among CYF's best such as \"The Killer\" and \"Hard-Boiled\" which are truly astonishing. However,if one day I come across a 2-DVD set of \"Rich and Famous\" and \"Tragic Hero\" I won't hesitate to buy it. Hopefully, these comments about \"Black Vengeance\" clear up, which was also for me, a mystery as to where it belonged in Chow Yun-Fat's filmography.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Jim Varney's first real movie is quite a delight, but don't come in expecting to see Ernest P. Worrel any time soon. I felt the wide array of characters Varney depicted were great, but without being said, the rest of the movie should be put into a mulcher or something. A rather odd beginning for a movie icon.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I have seen this movie about 4 times and every time I am impressed with the Second Camera Assistant's work. Seems trivial but there is something very professional, knowledgeable and talented there. The movie as a whole suffers from other problems, as stated by other comments. The significance so the issues being approached are as relevant today as it was 40 years ago. The acting is a bit strained but the work of the Second Camera Assistant is stellar! This person needs to get back into the business - perhaps directing? What is this person waiting for? I will be watching and waiting and cheering from the sidelines!- Bob",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I'm Mike Sedlak. I co-wrote the score for this movie. And proud of it. <br /><br />And I love all of the comments. Some have not gone far enough.<br /><br />The movie premiered in San Francisco in the summer of 1973. The theater was packed with friends and family. We all clapped.<br /><br />Five days latter, it was pulled from all of the screens in the Bay Area.<br /><br />If anyone is interested hearing some of scene by scene details, which might make the movie even more enjoyable, please let me know.<br /><br />We could start with the shot where Gideon Blake throws the toilet plunger to distract one of the evil henchmen guarding the radio transmitter on the deck of Bud's house. <br /><br />Or how Gideon diffused the bomb in the original version.<br /><br />Didn't help. It still bombed.<br /><br />Bring it on.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "When I first saw the trailer for The Comebacks, it looked absolutely horrible and I had no interest in seeing it, but when it came out on DVD today, I figured since there was nothing else that caught my interest, I would rent it and give it a shot. I watched it tonite and it really wasn't that bad. I think it was immature and stupid at times, but there were a few funny moments that made me laugh. I don't really watch many sports movies, so I wonder maybe if I saw more, maybe this movie would make more sense to me, but it's all good, I still didn't mind so much watching The Comebacks. I admit, these \"stupid spoof\" movies are lame, but what's the harm in a stupid joke every once in a while? The Comebacks isn't really that bad if you give it a fair chance.<br /><br />Coach Fields is failing in life, family and career both, but when he is offered a chance to bring his career back to life if he can bring a looser football team into the championship. But the team is really really terrible, like beyond terrible. But with a little work and team effort they try to give it their all, even though that might turn into something more sad.<br /><br />The Comebacks over all isn't the worst film I've seen, I think it's good for a couple laughs and giggles. I know that this was stupid, but I couldn't help but laugh when the coach comes in the middle of a fight in the locker room and he's beating the nerd's head against the locker, just him and the nerd in general were so funny together. If you have an open mind and don't take this movie too seriously, I think you'll have a fun time watching it, if you watch it expecting it to be Oscar worthy material, this is not the movie for you.<br /><br />4/10",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I can't add much to what has been said already, except I'm going to have to because of the 10 lines minimum policy.<br /><br />I've actually got this on a VHS-to-DVD copy, but the quality is quite poor and I desperately need for it to be officially released.<br /><br />I can just imagine what extras I would like to see (Tim Healy's character swearing his way through one of those 'Football Bloopers' type programmes would be great!). You can imagine it now, can't you? But of course, it looks like most people will have to carry on dreaming about a DVD release.<br /><br />Surely to God there must be someone in the DVD releases department at ITV who also knows something about British culture, is web savvy and has enough about them to look at IMDb now and again? Oh, well.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I saw this movie when it first came out in 1973 and loved it. Since then I've searched for a video but never found it until now, 33 years later, when I ordered it from Moviehunter. Sorry to say it doesn't hold up. This glamourized version just can't rise up to the 1937 production level. I love Burt Bacharach's musical score, that is if listend to by itself, and I even bought a CD of it, but for my taste it doesn't lend itself well to this mysterious and compelling story. Just doesn't fit. Michael York is lost here. Sally Kellerman tosses off a fine performance but Olivia Hussy is just ridiculous and not worth lugging through the Himalayas. The best performance is Charles Boyer as the head Lama.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Irwin Allen's first venture into all star spectacle was one all star disaster. The Story of Mankind contains some of the most incredible casting decisions of all time. Virginia Mayo as the blond Cleopatra, Dennis Hopper chewing the scenery with Napoleon, Peter Lorre dining on the scenery for weeks as Nero, Marie Wilson as Marie Antoinette as a roadshow Marilyn Monroe, that's just some of them.<br /><br />The film also is known for being the last film which featured all three of the Marx Brothers though they all have different roles. Chico plays a monk who is Christopher Columbus's confidante, Groucho euchres the Indians out of Manhattan island as Peter Minuit, and most astonishing of all, Harpo Marx as Sir Isaac Newton who discovers gravity when an apple conks him on the bean. <br /><br />Holding all these portrayals together is a story where mankind itself is being judged. A super H Bomb is about to be discovered and let loose will do in the world's population. It's Judgement Day a coming.<br /><br />But mankind has its advocates and detractors. Speaking for the prosecution is Old Scratch who's been bringing the worst out in man for centuries in the form of Vincent Price. But man has his good side as well and who better than Ronald Colman to demonstrate man at his most civilized best. Colman and Price plead their case before The Judge played by Cedric Hardwicke. <br /><br />In those three individuals you have some of the finest speaking voices the English language ever knew. When the film is on them as they each bring out the exhibits for their case it's a pleasure to listen to. Then when the focus is on the individual stories, you want to scream in agony.<br /><br />What was Irwin Allen driving at, I'm still trying to figure it out. Was he deliberately camping it up with some of these casting decisions? If it was satire, it just doesn't get off the ground.<br /><br />This was Ronald Colman's farewell film and while it's hardly something I'd like to go out on, I can't think of any man who could have stated the case for civilization any better. <br /><br />So when you see The Story of Mankind, fast forward through some of the exhibits and treasure every moment the advocates are before the judge.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "I think this is one of those few movies that I want to rate it as low as possible just to pay it a compliment.<br /><br />I haven't seen this movie in about 25 years, so I really can't say that much about it. It still seems to be very hard to find on video. But I remember my brother and I stumbled upon it somewhere in the toxic brew of late night UHF channel television of the mid 1980s when I was about 10 years old. So I've never actually seen the beginning of the movie, but I saw most of it. The first thing I remember is this couple is sneaking out of a campsite and they're rowing to an island to make out, and then they get attacked by an insane Scotsman in a kilt with an axe! They manage to escape from him but get attacked by the Loch Ness Monster, which in this movie is just a head and a neck with no body. The eyes and the mouth of the monster don't even move, it looks like a piñata.<br /><br />I mean I had just literally never seen anything on this magnitude before and it totally blew my mind. I had seen some bad movies on TV in the early 80s but I had never seen something so totally inept and so casually and thoughtlessly constructed that it seemed like the people who made it spent less time and effort on it than we did watching it. I had already seen some of the Troma films and that type of thing that tries to deliberately be \"campy\", but this was the pure and real stuff and it was my first encounter with truly great bad film-making. This movie was like the last gasp of the drive-in era and I caught a whiff of it just in time. Actually when we were watching it, we couldn't figure out if it was made in the 50s or the 70s. Turns out it came out just a few years before I saw it.<br /><br />Later I came into contact with Mystery Science Theater and found out about a lot of the old B movies and serials, but I had already seen it in this movie. The movie is so funny that I had never even laughed that hard at the Monty Python crew or Bill Murray or any comedian. After seeing this movie I was always trying to search for the \"good bad\" movies and I got a lot of my friends into it. But this movie was and basically is an impossible one to find. I never really found out what it even was or who Larry Buchanan was until the 1990s when IMDb took off and the internet took off and information started getting passed around. But this movie still needs to be discovered by a lot of others who might appreciate its transcendentally bad qualities. Look for it.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Sammi Cheng & Andy Lau are coupled yet again in their 3rd film -- YESTERDAY ONCE MORE -- directed by HK's actioneer Johnnie To...fans of To's action films will be disappointed to find not a single gun was used in the filming...furthermore, fans of Cheng & Lau's previous films, NEEDING YOU & LOVE ON A DIET, will also be disappointed to find that YESTERDAY is no where near as funny or endearing...<br /><br />Mr. & Mrs. To (Lau & Cheng) are a divorced couple...both affluent HK citizens...both incredibly mischievous...both just happened to be professional thieves -- 'two birds of the same feather'....A couple years earlier, they divorced over an inability to find middle ground on splitting the loot...Now she's remarrying...to the son of a rich heiress -- a total momma's boy (Carl Ng) through & through...The soon-to-be mother-in-law (Jenny Woo) is suspicious of Mrs. To's past & thinks she's only marrying her son for the family jewels -- the heiress' priceless ruby necklace...<br /><br />The necklace is stolen...is it Mrs. To's materialistic eye that gets the best of her?... or is it her ex-husband, Mr. To's way of sabotaging the marriage to steal the jewels for himself?...<br /><br />This is not a movie about two pple falling in love or rekindling a love...its about two pple who have always been in love but have somehow been to foolish to realize it...they let pride & greed overwhelm them...<br /><br />Overall: YESTERDAY is one part caper/heist film & one part homage to classic Hollywood glamour from its golden years -- i.e. Cary Grant & Grace Kelly's TO CATCH A THIEF...Johnnie To is riding too heavily on Cheng/Lau's chemistry from their previous films...hoping Cheng/Lau's immense popularity & fan base will be enough justification for this third film....I think Sammi Cheng is one of the most likable/charming entertainers working t'day...& Lau is definitely the Tom Cruise of Asian cinema...<br /><br />I really enjoyed their first two films & consider the Cheng/Lau pairing comparable to those classic Hollywood couples of the 40's & 50's...but YESTERDAY falls very short of expectations...terrible writing, ridiculous situations, product placements galore, & all the subplots & supporting characters were unnecessary...come to think of it...this film was unnecessary...unless you just love celebrity watching...",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "As powerful as the true story of Phoolan is, this book this film is based on came out before she herself was released from Prison and had the chance to tell it. <br /><br />It is allegedly based on her diaries but she is illiterate. How does that work? <br /><br />That said, some areas of he film are accurate and the acting isn't bad, with some sensitivity being shown. <br /><br />Really though this story needs to be old in a TV series. Far to much happens to cram into a couple of hours. <br /><br />Read her autobiography. Highly recommended. It is a fantastic story.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "MELTDOWN is pretty interesting SCI-FI. No major budget, very few special effects; but decent acting and a storyline of global doom is enough to sustain viewing. An asteroid grazes the atmosphere and thrust the Earth into an orbit closer to the sun. Global warming rapidly becomes unbearable. A determined LAPD cop(Casper Van Dien)goes all out to save the world from certain annihilation as the rising temps are devastating. The pressure is on to save mankind from this solar catastrophe; as well as protect his daughter, nurse ex-wife and TV reporter girlfriend. The cast includes: Stefanie Von Pfetten, Venus Terzo, Amanda Crew and Vincent Gale.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Lucio Fulci's Cat in the Brain is an inventive and somewhat egotistical tale of a director's decent into madness. The director in question is Fulci himself, who stars in the film. Fulci has become known to horror fans everywhere as 'the godfather of gore', and for good reason, as he has provided us with some of the nastiest and most gruesome films ever to grace the silver screen; from the eyeball violence in films like 'Zombi 2', to a man been hacked to death with chains in 'The Beyond', all the way to the full on gore fest known as 'The New York Ripper'; if you want gore (and let's face it, who doesn't), Fulci is your man. However, all this catering for gorehounds like you and I has taken its toll on Fulci's mental state, and he's quickly delving into madness, brought about by what he films. Fulci's problems don't end at his mental state either, as his psychiatrist that he has gone to see about his problem has took it upon himself to take up murder as a hobby, using Fulci's films as blueprints for the murders!<br /><br />I've got to say, the acting in this film is absolutely atrocious. There is one scene in particular that involves a hooker, and it's only fit to be laughed at, for both it's acting and it's stupidity. Fulci takes the lead role of the film (obviously). He's not an actor, and it shows, but his performance is actually the best in the film. It's even safe to say that one the whole, the acting is bad for an Italian horror film. Of course, nobody goes into an Italian horror expecting good acting, so it's somewhat forgivable, but I do think that Fulci could have hired some better ones. Bad dubbing doesn't exactly help either. However, something that does help is the fact that the terrible acting is counterbalanced by lots of gore, and it's extreme to say the least! People get their heads cut off, a woman is slain in the shower (and unlike Psycho, here we REALLY see it), people are hacked up, fed to pigs and there's lots and lots of cinema's finest melee weapon - the chainsaw on display, which delighted me no end. The amount of gore is massively over the top a lot of the time, which gives the film something of a 'spoof' feel, but Cat in the Brain is obviously a tongue in cheek film anyway.<br /><br />It would be hard to make a film about yourself and not come across as being a bit of a big head, and Fulci does indeed come across as a bit of a big head in this movie. His name is mentioned often, and he's on screen nearly all the time; it's not too much unlike 'New Nightmare' in the ego stakes, but it's obvious he had a good time making this, and I for one had fun watching it, so we can forgive him a little egotism. The film's ending lets it down - I saw it coming a mile off, but then didn't seriously think that the movie would take that route, but I was wrong; it did, unfortunately. The ending left me cold, and the film is a better watch if you turn it off just before the final two minutes. However, despite it's ending and terrible acting, Cat in the Brain is a lot of fun and will please Fulci enthusiasts no end, and it is therefore recommended.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I first rented this movie on the infamous day of September 11, 2001. Since then I've seen it a number of times. My only complaint is that it's too short. \"Strangeland\" would've be a complete piece of horror art at two hours. As it stands, the running time is only an hour and a half.<br /><br />Ex-Twisted Sister member Dee Snider wrote, produced and stars in this 1998 shockfest set in a small Colorado town. He plays Carleton Hendricks, a crazed sadist who has psychotic ideologies on human evolution and a love for near-death experiences. Hendricks is no pushover, he's a pumped up six-foot \"modern primitive\". Someone who has tattooed and pierced their body to the very extreme. When he makes his first full appearance in the film, it is a truly terrifying sight.<br /><br />Hendricks' main hobby in life is to share his \"spiritual awakenings\" with his kidnapped victims. He visits Internet chatrooms under the name \"Capt. Howdy\" and then invites people over to his house. They believe they're going to a party. Instead, they find themselves in a house of pain and suffering. Hendricks sows their eyes and mouths shut and tortures them by sticking blades and hooks in numerous parts of their body. If it sounds sick, it's because it is.<br /><br />One of Hendrick's victims is Genevieve, the teenaged daughter of detective Michael Gage. Gage not only manages to save her, but arrests Hendricks as well. Four years later, Hendricks is released from a mental institution completely rehabilitated to the disapproval of the community. A group of rednecks led by Freddy Krueger himself, actor Robert Englund, decide to kill him. They fail and Hendricks reverts back to his old self.<br /><br />The rest of the film I'll leave to you, only to say the conclusion is satisfying and will leave you in shivers. With the exception of Snider, the acting isn't too good, but it's serviceable. The direction is okay, too. There are some humorous parts in \"Strangeland\" and they are very funny. I also loved the soundtrack, it's awesome and worth buying if you love rock. Overall, this is a movie worth watching. If you love low-budget horror films with a sense of humor, check it out. You'll probably like it.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Meester Sharky, you look so ... normal. You would never get a table in this fancy cocktail restaurant/bistro. I, on the other 'and eat grapes and pate 'ere every day. You like my fur coat with all the fine trimming? My enormous golden rings of gold? Or maybe you like these blonde, 'ow you say?, bombshells, who are all qualified in aerobics and naked petanques, who decorate my long, maroon velvety sofa like so many soft boiled larks on a plate of pan fried foie gras and figs. You like? You can't have! Zey are all mine.<br /><br />You will never possess 'er as I possessed 'er. Domino was the best, apart from Maman. You do not understand the art of lovemaking. Just look at your inferior moustache. It is almost funny to me, non, to think of that ludicrous protuberance on your silly face, as you snuffle around Domino's love hillock like the piggy seeking the truffle in the forest, the forest heaving and swaying in the hot winds of desire! You lose again Sharky.<br /><br />When I make love to the women zey know, Sharky, zey know. Zey learn, zey learn until zey become the teacher. Not nano-maths, the arts of love. Domino was the seedling which I watered. I watered her so very often. Everywhere Sharky. Her scented petals, her proud stalk, everywhere. She will wither under your ridiculous hose, like the soufflé removed from the oven five minute too soon.<br /><br />I must go now Sharky, you bore me so with your disgraceful behaviour. It is you who will be flushed down le pissoir like the smelly thing.<br /><br />Bon chance!",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Based on the comments made so far, everyone seems to either hate this movie or love it. I think it would be fair to point out that although this is not a GREAT movie, it has its interesting moments. For one thing, it was filmed on location in Colorado (was it Breckinridge or Telluride? I can't remember, but it is in the credits). The location is absolutely stunning and spectacular. It's beautiful, even to me who lived in Colorado for several years.<br /><br />Next, it has Disney's penchant for wonderful character actors. Harry Morgan has never been in better form than when he plays in a Disney movie. He is literally hysterical. Also, remember the wonderful Mary Wickes? Although she has a \"bit part\" in this movie, she is great, as always. If you don't know who she is, think of the animated Disney version of Hunchback from Notre Dame (she was one of the gargoyles), and she was also the most interesting nun in \"Sister Act\", as well as the best nun in \"The Trouble With Angels.\" She has always been a great character actress and most character actors never receive the recognition they deserve.<br /><br />In addition to character actors and all-star casts, in the 1960s-1970s Disney may have not had the \"greatest\" movies, but, if you really watch some of them from beginning to end, you will NOTICE that every movie has some really funny or hysterical moment in it. The entire movie may not be funny, but there is always a comic gem (at least 1 or 2) in every single \"live-action\" movie Disney ever made. Whether it's Harry Morgan in one of his bellowing tones of voice, or Tim Conway floundering around, or Joe Flynn giving one of his priceless looks of horror, it is all good. The whole film may not be good, but there are ALWAYS hysterical moments in every Disney film from this period that I have ever seen. Disney in this time period always managed to make a person smile, despite the dumbness of the film.<br /><br />Bsed on these comments, I disagree with viewers who say every Disney movie in this time period is awful. That statement it not quite accurate. Rather, it is easier for me to give credit to the funny moments and overlook the weaknesses in the plots.<br /><br />Some live-action Disney movies are true classics (Old Yeller, Bedknobs and Broomsticks, Mary Poppins), but for those that aren't, I am able to appreciate them for what they were -- good clean family fun in a time when movies had become vulgar, crude and offensive.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Hulk Hogan stars as a champion wrestler (A real acting stretch...) named Rip, who is forced to defend his honor, his title and his girlfriend from a greedy corporation that wanted him to sign for their network (Because wrestling sells!) however when Rip declines, the network gets a circuit fighting championship called (and i'm totally serious) \"Battle of the tough guys\" who's champion Zeus (Played by Tiny Lister Jr) maybe the deadliest man alive. Rip refuses to fight, until his brother is attacked and put in a hospital. No Holds Barred is pretty much what I expected from Vince McMahon production starring the least versatile actor in the action genre (Hogan) it is basically lots of unintentional humor, tons of awkward sequences, a couple okay action sequences and tons of stupidity. In other words it's not unlike wrestling itself, so I give it a fair rating mainly because anyone renting this knows what they're getting. The movie is cheap but well made enough for what it is and really wrestling fans will probably enjoy this. I myself found this to be ultimately hilarious. They're are moments of such absurdity that you only chuckle to yourself. (Such as the way Hogan jumps 20 feet in the air after being stuck in a limo, how he forces a guy to crap himself and of course the way Hogan recites from his cuecard. (I.E:\"I'm not going to be around when this check clears!\") No Holds Barred is a lot of fun, true, though it's mainly because of how ridiculous it is. Fans of camp should really enjoy this clever clinker.<br /><br />* * out of 4-(Fair)",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "\"Death Wish 3\" brings back Charles Bronson as one time vigilante Paul Kersey,now retired.yeah,right.before long Kersey is back to his old ways.but this time,its not just a few muggers at a time,its a gang who have taken over a run down part of the city(New York again,by the way.)this time its war,so Kersy Hauls out the big guns(literally) for this.the body count int his one rivals anything Stallone or Schwarzenegger have come up with.this movie is actually somewhat fun to watch,particularly for a few one liners and of course bad guys die,or get severely injured in creative ways,which is always a good thing.the violence is not as personal in this one,its,obviously on a much grander scale,sort of like bombing your victims from afar,rather than one on one combat.this movie is lighter in tone than the 1st 2,making it easier to watch.there's not much import to this film,its more escapism than anything.its also cheesy at times and pseudo-inspirational,but hose scenes fall flat. they should have left the original \"Death Wish\" on its own without sequels,but since they didn't,they should have stopped here. 8 /10",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "How many monster tree movies can you see in a lifetime?Well I'll go out on a limb and say one.This movie is better watched late at night,with a 12 pack of beer, the sound off and you and your friends making up the dialogue.<br /><br />On a Pacific Island a young man is sentenced to death for consorting with the \"evil Americans\".(Seems his loving wife has been sleeping with the witch doctor and they set him up to die so the doc' can be king).Well he vows to come back and wreak revenge.<br /><br />Before you can shake a stick the goofy natives run to the American scientists' hut screaming\"Tobanga come!\"<br /><br />It seems the young corpse has done just that as Tobanga, the walking tree monster. Yes his revenge is terrible (and so is this movie).It seems that these natives cannot run from a lumbering tree so he tosses them in quicksand,rolls them down hills etc.Pretty soon the new king wants to trade his woman or kingdom for an axe or a chainsaw.<br /><br />General problems with this movie are numerous. The comedy relief is an obnoxious woman with a Cockney accent (like this movie needs comedy).You want her to die upon her first appearance.The leading lady is whiny.The leading man is a boor.The acting is wooden (pun intended).The dialogue is stiff and lumbering.The natives have Brooklyn accents.The monster suit is pure giggles.<br /><br />While this is a bad movie it still is fun to watch.It gets a 3 on unintentional laughs alone.Your dog may rate it just a bit higher but only if the tree wasn't mobile.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "if you are dating a girl that is into wicca!<br /><br />many parts of this movie were killer and the feeling you get from this movie while watching it and immediately after is enough alone to sit through it all but some things really bothered me about this film that i cant really put my finger on...<br /><br />i definitely think that this movie is one that any art student or photography student should see b/c of the camera style and graininess that ive never seen but that is just it...it looks like an art student made it and the plot if there is any is so jumpy that you really need to be on a lot of drugs to get just what is going on",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "The problem with this series is that it is too real. I am watching it on Amazon \"Unbox\" and having just finished episode 2 I hate, absolutely hate, Fark, the leader of the Cell. I cannot recall any television series ever having this emotional impact. Remember the old tag line for horror movies \"Just keep telling yourself its only a movie\"? Well I find myself repeatedly reminding myself that its \"only TV\". But of course it isn't only TV is it? The possibility of a cell such as the one portrayed here actually operating in the United States is certainly within the range of plausibility. That's what gives this program its vicious authenticity. And that's why I hate it so much.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "Its difficult to be too tough on Brad Sykes, a hard-working guy doing what he loves, there is an honesty about him that seems often lacking with other microbudget directors. Check out the minuscule crew credits on Camp Blood, there is none of the usual thanking everyone down to the pizza joint they ate in, its Brad and his buddies and thats it, no pretentious rubbish. Jennifer Ritchkoff isn't your average horror flick heroine, but does well enough for you to hardly notice, Bethany Zolt looks like a star and Joseph Haggerty is so funny it hurts. The Clown is hardly an original horror film bad guy, but the design is good, Shemp Moseley does a decent job of bringing him to life and the image clashes nicely with the rural backdrop. Camp Blood is horror as blue collar and basic as it gets, not a good thing, not a bad thing, just a thing.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "The Merchant of Four Seasons is a film about a lack of love. The film starts off with the main character; Hans Epp, returning from a spell in the foreign legion. He returns to his mother, not to be told how much she loves him, or how much she's missed him; but to be told that he is worthless and, even worse, that she would have preferred the man he went with to have come back instead. It is the character's relation to women that makes this film so hateful; the fact that his wife is taller than him is symbolic of his relation to the other gender; he is consistently humiliated by them, and it is through his relations with them that his life isn't as great as it could have been. This is also shown clearly by the way he treats his wife after a drink. He lost his job as a policeman through lust for a woman, and even his wife; a woman that is supposed to love him, never really shows any affection for him. Even at the end, his wife is more bothered about what her and her daughter will do than the state of her husband.<br /><br />The Merchant of Four Seasons is a thoroughly unpleasant film. There isn't a scene in the movie where someone is happy, and not only that; but the movie seems deliriously blissful to wallow in the misery of it's central characters. The movie is certainly not recommended to anyone who is currently having a hard time, that's for sure. Despite all the misery, the film never steps out the bounds of reality; every event in this movie can - and most probably has - happened, and that only serves in making the movie more shocking. The film is, of course, helmed by Rainer Werner Fassbinder; the cult German director that committed suicide in 1982. This is only my second taste of the man's work, but through just two films, it is easy to get an idea of the type of art that he creates. Both films are downtrodden and gritty - yet realistic pieces of art. His characterization in this movie is subtle; we only ever get to know the characters through their plight's and not through their character. This is a very clever way of showing the audience that it is their surroundings that define the people in the film, not the people themselves - and as nearly everyone that sees the film knows what living in an urban society is like, it wont difficult for the majority of people to relate to. <br /><br />The Merchant of Four Seasons is not a film that is easily forgettable; the movie is high on substance and low on style, and that makes for a very memorable picture, and one that everyone who considers themselves to be a fan of cinema should experience. It is with that in my mind that I give this film my highest recommendations; it's not sweet and it's not pleasant, but you will not see a more realistic portrayal of depression, and this is most certainly a movie that will stay with you.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "It's always interesting to view a horror movie after hearing so much praise from other fans. Experience has taught me that you should never generalize fan taste within a genre. My expectations of this movie were a great deal higher than my viewed opinion.<br /><br />Children Shouldn't Play With Dead Things is a movie with a good intended plot that trips up too many times to carry it out. The whole idea of a band of actors staging a reanimation of dead corpses had me intrigued. However, everything degenerated into cinematic chaos. The actors,who for the most part were competent and amazingly expressive, were offered roles that fail to maintain consistent characterization. Some of these characters go from ambivalence about the whole act of defiling a cemetery, to outspoken criticism, back to ambivalence. It's one thing for characters to have a change heart in the course of the film; it's another to produce an overly dynamic, circular attitude that loops every ten minutes.<br /><br />Another inconsistent element of this film is the premise. Does the main protagonist intend for the ceremony to be theatrical prank or does he actually conspire with dark spiritual forces to raise the dead? Even with the aforementioned flaws, I would recommend this movie to other horror fans, since I believe that only true horror fans will appreciate the dark atmospheric components and be able to ignore the plot's inconsistency. The scene where the dead rise out of the grave is made extremely haunting (even to a veteran zombie enthusiast) by the excellent combined use of scenery and sound, and the great choice of skilled actors chosen to play the reanimated dead. Current filmmakers should learn from CSPWDT about using the proper video and audio techniques in mood development.<br /><br />All in all, if you are zombie movie completionist like me, you should take time to locate and view this movie. It's a fun watch.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "\"For a Squadron Leader - normally the only guy trained and equipped for navigation in a squadron and very hard to replace - to risk an expensive plane and himself to pick up a crashed fellow pilot, no matter how close a friend he is, in the face of oncoming enemy troops, is hard to believe, especially when they both have to share a cramped Spitfire cockpit - two into a Skyraider, OK, but a Spit?! Come on, this part of the film is a Biggles adventure, not fitting a film that one is supposed to take seriously!\" as said by Tord S Eriksson (Gothenburg, Sweden) is rubbish. Not at all Biggles. One true story of the war comes to mind of two grounded spit pilots, who planned and flew (illegally) a strafing mission over France. One had to crash land and his friend landed his spit under fire, while German infantry was moving in on them, and flew them both out of there. In a spit. They were BOTH severely injured in former fights, one had an artificial leg from the knee down. Now that may sound like something out of Bigles, but it happened. Ill get sources if needed",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I missed the full four hour version when it was originally released in theaters because it played one week. I had to settle for seeing the shorter two and a half hour version a year or so later and was left stunned by what I saw. I left the theater thinking I had witnessed a masterpiece and wondering what the full version was like.<br /><br />The full version is mostly good but it has sequences that are so incredibly dull that the whole movie is pulled down and almost sinks beneath the waves.<br /><br />The problem is entirely in the editing which should be labeled as the final word on excess. There are times when things go on and on and on and nothing happens. Shots of people in a city that go on much too long with no purpose in the narrative. We get beautiful vistas and visions of such beauty that they bring tears to your eyes but they are used too frequently as a place holder instead of as punctuation or to set a place. Much of the longer version seems to be on screen simply because it looked good.<br /><br />I've attempted to actually sit down and watch Heavens Gate with out resorting to the Fast Forward button but somewhere along the way I find I can't stand it any more.<br /><br />I wish MGM would take pity on us and release the shorter version to DVD as well as the huge dinosaur. Perhaps as a two pack so that we could see which is the better version, and whether Cimino was mad or not.<br /><br />And while they were at it why not include the once rumored Johnson County War edit that ran 90 minutes. Supposedly United Artists tinkered with a further cut in the hopes of getting some of their money back. Whether it was ever done or still exists is up in the air, but it would be interesting to see.",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "this was made in that beloved age known as the 80s and shot in my hometown of New York City. actually, this has become one of my favorite b sci-fi movies. Oh, sure, it really stinks to high hell, but there's so much to make fun of, laugh, and enjoy that it becomes more tolerable after every viewing.<br /><br />Such as:<br /><br />Try to find the similarities between this and...well, OK, there is nothing similarly bad as this. Well, except Castle of FuManchu.<br /><br />Sock puppets can be dangerous to your health<br /><br />Create supense by describing through voice over rather than showing any imagery<br /><br />Have leading villainess \"Valeria\" (played wonderfully by Angelika Jager) deliver some of the most riveting lines ever!!<br /><br />Lots of men and women in post apocalyptic fashion (aka leather bikinis, loin cloths, and dead animal fur)<br /><br />Do be horrified by the end!<br /><br /> I'm off to have a salad. Toodles!!",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "His significant charisma and commanding presence are about all that keep this afloat, but Fred Williamson has done far better urban action films including many of his later, vid-released fare. The big studios' Williamson films of the early-to-mid 70's rarely had the punch of their mid-level counterparts, and this is a prime example. Clumsy action, little violence, and the PG rating is nowhere near questionable. Worth a look for Hammer completists in any case.",
      "gold_label": 0,
      "predicted_label": 1
   },
   {
      "txt": "Once again I must play something of the contrarian. Most of the reviews for Ab Tak Chappan have been extremely positive. Mine is positive, but only slightly. A 7 out of 10 is equivalent to a \"C\" letter grade from me.<br /><br />It seems that a lot of the praise is rooted in two factors: One, that Ab Tak Chappan is more realistic than the typical Bollywood film, and two, that it is trying to do things differently.<br /><br />The first point I couldn't care less about. I'm not looking for realism in films, and so I do not score higher for a film that shows a story and characters closer to how I believe the real world to be--I'm a big fan of surrealism, fantasy, absurdism, and so on, although I do not dislike realist films merely for the fact that they're realist.<br /><br />For the second point, I agree that it is commendable to try to do things differently. However, I don't think \"originality\" versus formulaicism makes for a better or worse film in itself. A film can be \"original\" and poor, just like a film can be formulaic and excellent. What matters are how well the film does whatever it sets out to do and how enjoyable or aesthetically rewarding that is to the viewer.<br /><br />Ab Tak Chappan is based on the true story of a Mumbai cop named Daya Naik. Naik was an \"encounter specialist\". Encounter specialists, who could be said to be early instantiations of real world \"Judge Dredds\", are trained to operate like the criminals and gang members they pursue, and they're basically given a license to kill--effectively acting as policeman, judge, jury and executioner in a matter of moments. Ab Tak Chappan follows the story of Sadhu Agashe (Nana Patekar), the encounter specialist based on Naik. We see him at work, interacting with his fellow encounter specialists and engaging in violence. We see him at home, trying to live a normal life in his less-than-luxurious surroundings. We see him trying to adjust to a new \"commissioner\" halfway through the film. And we see his odd relationship with a notorious Indian gangster, Don Zameer Zafar (Prasad Purandhare).<br /><br />All of this has the potential to make a fabulous, gritty film. I agree that it's nice to forgo the typical Bollywood musical numbers and romances--not every film needs that stuff; Ab Tak Chappan producer Ram Gopal Varma is famous for leaving music and romances in the background or by the wayside in many films that he's directed or produced. Additionally, Ab Tak Chappan has some good performances--Patekar almost gives off a Death Wish (1974)-era Charles Bronson vibe. It also has admirable cinematography--the hand-held stuff near the beginning of the film was particularly effective, for example. It has a great score that mixes more of a moody Hollywood-sounding action/crime score with traditional Indian instruments and modalities. The violence is well done and gritty.<br /><br />There is also decent exploration of subtexts, including the morality of (having) encounter specialists, the idea of following orders, and so on. The encounter specialists are shown having to largely divorce themselves from ideas of right and wrong. More poignantly, the film questions the merit of blindly following orders. Parallels are drawn between the encounter specialists following orders and, say, members of a country's military, and we're shown what a corrupt situation this can lead to.<br /><br />But (you just knew there was a \"But\" coming, didn't you?) director Shimit Amin and his scriptwriters have created a story with far too many characters, far too much sprawl, and that moves a bit too slow. All of these problems may be due to Amin and crew looking at the Godfather films, which Ab Tak Chappan has some (at least superficial) resemblances to, although from a policeman's perspective.<br /><br />Most of the encounter specialists we do not get to know very well--these are shallowly drawn characters to say the least, except for Agashe and Jatin Shukla (Nakul Vaid). For one, Narayan, I didn't know who he was until at least halfway through the film. His name is mentioned a number of times, but I'd only get glimpses of him until the scene would change. Then everyone would change clothes by the time they appear again and I'd have to start all over figuring out who Narayan was.<br /><br />The same thing happened with Agashe's first commissioner. The film was already far into the new commissioner before I could figure out the relationships. It seems like there are new characters in every scene. We never learn the stories of most of them. While that might have some artistic merit in that the encounter specialists are mostly killing people they do not know anything about (because they're mostly doing so on orders), since we do not learn much about most of the encounter specialists, either, it's difficult to find characters to care about, and that doesn't exactly make for a gripping film.<br /><br />The primary villain is Zameer. But until about halfway through the film, there's no indication of this. He doesn't get much more screen time than the other villains parading through the film, and he's literally \"phoning his performance in\"--he's in another location (Dubai), communicating only by telephone for the majority of the film. We don't actually see Zameer doing much. To an extent, the film depends on a couple \"twists\" that necessitate not showing Zameer doing a number of things, but we could see him do other things, and a lot of the other villains could have been left out.<br /><br />That would have tightened up the film a bit, making it more focused and about a half-hour shorter, both of which would have benefited its impact. This is not an action-packed film by any means. For at least the first 45 minutes or so, I found myself admiring Ab Tak Chappan's considerable style, but saying, \"Okay, get on with the story already\".",
      "gold_label": 1,
      "predicted_label": 0
   },
   {
      "txt": "I don't know if it's fair for me to review this. I'm not a fan of gratuitous violence. I've never understood the movie industry making heroes out of mob members and cold blooded killers. When The Godfather came out, I thought they had broken the mold, but the decades have produced a series of well-acted mob movies with major stars and directors doing them. This one is obviously low-budget, but it is certainly well done. At some point in all of these I feel like I want to take a shower. If such characters actually exist, it is hard for the soul. I always intellectualize that humankind will rise above this sort of thing. This kind of crud has to be stopped. I hope the people that go to films like this are more voyeuristic and less vicarious. I feel sort of the same way about slasher movies. Why do we have a fascination with death and dismemberment? In fairness, I am judging this on the acting and directing, and for what it is, it seems to work pretty well.",
      "gold_label": 1,
      "predicted_label": 0
   }
]